{"intents": [
    {"tag": "greeting",
     "patterns": ["Hi there", "How are you", "Is anyone there?","Hey","Hola", "Hello", "Good day"],
     "responses": ["Hello, thanks for asking", "Good to see you again", "Hi there, how can I help?"],
     "context": [""]
    },
    {"tag": "goodbye",
     "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time"],
     "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."],
     "context": [""]
    },
    {"tag": "thanks",
     "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
     "responses": ["Happy to help!", "Any time!", "My pleasure", "It's my pleasure", "It's my responsibility"],
     "context": [""]
    },
    {"tag": "noanswer",
     "patterns": [" "],
     "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand", "Hey, I can't get you"],
     "context": [""]
    },
    {"tag": "noanswer_enter",
     "patterns": ["\n"],
     "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand", "Hey, I can't get you"],
     "context": [""]
    },
    {"tag": "options",
     "patterns": ["How you could help me?", "What you can do?", "What help you provide?", "How you can be helpful?", "What support is offered"],
     "responses": ["I can guide you how to start learning and practicing Japanese effectively with a lot of interesting features for example grammar lectures, practicing exercises, look up vocabularies through text, recognize handwritten or scan image, even support you searching or navigating functions by microphone speech."],
     "context": [""]
    },
    {"tag": "lecture",
     "patterns": ["Give me lecture", "Open lecture", "How to check lecture", "lectures", "lecture" ,"grammar"],
     "responses": ["Open lectures"],
     "context": [""]
    },
    {"tag": "exercises",
     "patterns": ["exercises","homework","practicing exercises","practicing" ],
     "responses": ["Open exercises"],
     "context": [""]
    },
    {"tag": "dictionary",
     "patterns": ["dictionary", "open dictionary" ,"look up","lookup","search new words","search word","open look up"],
     "responses": ["Open dictionary"],
     "context": [""]
    },
    {"tag": "handwriting",
     "patterns": ["handwriting","open handwriting","handwritten","open handwritten","hand writing","hand written" ],
     "responses": ["Open handwriting"],
     "context": [""]
    },
    {"tag": "camera",
     "patterns": ["scan image","use camera","camera","open camera"],
     "responses": ["Open camera"],
     "context": [""]
    },
    {"tag": "vocabularies",
     "patterns": ["vocabularies", "give me vocabularies","vocabulary","new words","new word" ,"word list"],
     "responses": ["Open vocabularies"],
     "context": [""]
    },
    {"tag": "job_fairs",
     "patterns": ["open job fairs", "open job fair","job fair","find jobs","job fairs" ,"job seek","seek job","find job","I want to find jobs","can you give me some jobs information","get job","getting a job","I want to find job","I want to seek job"],
     "responses": ["Open job fair"],
     "context": [""]
    },
    {"tag":"summarizer",
    "patterns": ["can you summarize for me","can you summarize","summarize this document","summarize"],
    "responses": ["OK. I will summarize your documents immediately, please wait for a second."],
    "context":[""]
    },
    {"tag":"kanji_strokes",
    "patterns": ["open drawing strokes","open drawing","open draw","draw strokes","open Drawing", "open Draw","Draw strokes"],
    "responses": ["open drawing strokes"],
    "context":[""]
    },
    {"tag": "learning_guide",
     "patterns": ["How to learn Japanese","learn Japanese","learning guide","japan study","study japanese"],
     "responses": ["You should first start from learn more about Japanese culture and their lifestyle through many internet sources.If you feel excited, want to know more and become Japanese master, you can move to next step. Firstly, you can start with learning hiragana alphabet and try to remember, read them as much as possible by spending 30 minutes to 1 hour a day. After that, you can try to write what you learned and practice simple pronunciations, that's very important and certainly helpful for you in the future. Next, you can try katakana alphabet with the same steps but don't touch kanji too early. Move to N5 simple grammars and try to learn,speak and write greetings sample sentences by hiragana. Move to next harder grammars from N5 to N4 and continue keep practicing. When you end N5, you can start learning Kanji by remembering, reading and writing through grammars and sentences in lectures. That's all preparation steps to become master Japanese. If you can't learn yourself, you can learn at any reputation Japanese centers and some of them, I will mention if you ask. "],
     "context": [""]
    },
    {"tag": "japanese_centers",
     "patterns": ["what center should I learn", "japanese center", "center","Can you suggest some centers","suggest center","recommend center","study place" ],
     "responses": ["Sure, I will give you information about some reputation centers in Vietnam and even in the world. If you are Vietnamese citizens and want to learn Japanese, you can consider some centers for example Riki Nihongo, Dung Mori Center, Kohi center, SOFL center, Akira center. If you can study in Japan, you can try Arashiyama Bamboo Grove center, Dontonburi center, Fushi-Inari Taisha center. If you want to know more, please search in google"],
     "context": [""]
    },
    {"tag": "instruction",
     "patterns": ["can you tell me how to use","how to use","instruction","using guide","guides","guide"],
     "responses": ["Certainly! I have some main fuctions as following: Firstly, provide you Japanese grammar lectures, exercises and vocabularies respectively. Secondly, I can support you look up or search new words through looking up by text, search by handwriting or scan images to recognize japanese words. Thirdly, I can provide you information about japanese culture, history, cuisine and even more. Fourthly, I can suggest you where to start learning, japanese learning centers. Fifthly, provide you information about job opportunities in Japan based on your degree and your experience. Awesome, right? But I will improve myself and conjure developers add more helpful features to support you guys even better in the future. "],
     "context": [""]
    },
    {"tag": "japanese_culture",
     "patterns": ["japan culture", "japanese culture", "culture"],
     "responses": ["Japan is famous for a lot of things but I can summarize as following: Japan's architecture, art, traditions, crafts. Also, its worldwide known pop culture (including manga, anime, and video games). It's something that definitely only Japan can offer. No other country contains the same characteristics.The food is something we cannot put aside! Who doesn't love Japanese food? Ramen, sushi, udon, yakiniku, okonomiyaki, takoyaki, and many more!! The food is amazing! Something that surprises most people when they first arrive to Japan is how polite people are. Japanese people tend to be always really nice even if they're not having the best day. Always helping people when they are in need, like giving directions, and sometimes even taking the person to the place they want to go to when they might have a prior engagement. People always follow the rules and maintain order anywhere they go.Another thing that most visitors in Japan get stunned by is by how everything works so smoothly in Japan. Public transportation is probably one of the main things. Buses, Trains, Bullet trains, everything! It’s just so convenient for travelers and locals. It is incredible the punctuality in which these types of transportations work by. "],
     "context": [""]
    },
    {"tag": "japanese_cuisine",
     "patterns": ["japan food","japan cuisine","japanese food","japanese cuisine","street food","ramen","takoyaki","yakisoba"],
     "responses": ["Unique and beguiling, Japan is a country of binaries. It straddles both the traditional and ultra-modern, with buzzing cities alongside stunning natural landscapes. Its food is famously nutritious, with a diet based around super-fresh, seasonal products. We've picked 10 dishes to seek out when visiting. Don't leave Japan without trying… 1.Sushi , 2. Ramen - japan noodles ,3.Sashimi - fresh food ,4. Unagi - grilled eel, 5. Tempura - deep fried shrimps, 6. Kaiseki, 7. Soba - another japan noodles, 8. Okonomiyaki- grilled any kind of meats and vegetables together , 9.Tonkatsu - fried pork filet, 10. Yakitori - fried, grilled chicken ,11. Takoyaki - grilled octopus with rice flour, 12. Sukiyaki - beef hot pot"],
     "context": [""]
    },
    {"tag": "anime",
    "patterns": ["anime", "animation", "japan anime","japan animation","japanese anime","japanese animation"],
    "responses": ["Most anime fans can sum this up in two words: It's different. Anime is as unlike most American cartoons like Batman and Spider-Man are different from the comics that run in daily papers. These differences show up in many ways including the artwork storytelling, breadth of material and even cultural nuances exhibited by the characters. Some famous anime I can tell you for example One piece, fairy tail, naruto, dragon balls, one punch man , boku no hero academy and a lot of interesting kind of anime you can find."],
    "context": [""]
    },
    {"tag": "manga",
     "patterns": ["can you tell me about manga","manga","comic","comic market"],
     "responses": ["To put it briefly, manga is the Japanese word for comics published in Japan. The word itself is comprised of two characters: man  meaning whimsical and ga meaning pictures.Manga can be for entertainment or education, although in the United States manga for entertainment is what is mostly translated and published. Manga is for people of all ages and it is not seen as something just for children. In Japan, doujinshi (comic made by fans or unofficial artists) marketplaces are almost always independent public events where the focus is on the individuals and groups that publish the doujinshis. "],
     "context": [""]
    },
    {"tag": "japanese_games",
     "patterns": ["japan games", "games", "can you tell me about games","video game"],
     "responses": ["Video games are a major industry in Japan. Japanese game development is often identified with the golden age of video games, including Nintendo under Shigeru Miyamoto and Hiroshi Yamauchi, Sega during the same time period, Sony Computer Entertainment when it was based in Tokyo, and other companies such as Taito, Bandai Namco Entertainment, Capcom, Square Enix, Konami, NEC, and SNK, among others. I can suggest you some outstanding video games of Japan for example Dark Souls series, Sekiro, Bloodbourne, Elden ring from From Software company, Final Fantasy series from Square Enix and many other kinds of games. "],
     "context": [""]
    },
    {"tag": "japan_jobs",
     "patterns": ["japan jobs", "occupation", "job opportunity", "jobs","job opportunities"],
     "responses": ["The Japanese work culture and outlook on human relations make all employment options good ones to opt for. Naturally, the question arises, what are the career chances for those who have learned Japanese? What options exist, and what would they entail? To clear up all the confusion, I have put together a list of the available opportunities for you. Here are 19 top careers after learning Japanese. 1. Career as a Japanese translator, 2. Jobs for Japanese interpreters 3. Media and subtitle related work 4. English teacher in Japan 5. Analyst or data curation 6.High-tech engineer and even more. Please search more information in google"],
     "context": [""]
    },
    {"tag": "stydy_in_japan",
     "patterns": ["should I study in japan","study in japan", "learn at japan", "study aboard in japan","exchanged study in japan"],
     "responses": ["The country is rather mountainous, but the coastal life will also give you the opportunity to explore the numerous islands as you study abroad in Japan.No matter which major you are interested in studying, if you study abroad in Japan, you will get experience of living in the world's third largest economy, since Japan is a great financial power."],
     "context": [""]
    },
    {"tag": "japan_manners",
     "patterns": ["can you tell me about japan manners","japan pleasure","japanese manners","japanese pleasure"],
     "responses": ["You can call it is Etiquette. Since Japanese people believe individuals are less important than the group, everyone strictly follows the rules of the etiquette. Some of the most common etiquette social faux pas foreigners make in Japan are: Speaking on the phone while riding a train, Not returning a personal favor by gifting a box of sweets, Eating something while walking or eating something on the train, Taking or giving something by only using one hand, Showing up for a meeting just in time (People are supposed to come to meetings 5-10 minutes earlier, NOT at the exact beginning time), Passing food to someone by using chopsticks (this act is a reminder of funerals), Not taking off shoes when entering someone's house, Writing someone's name in red ink, Giving white or yellow Chrysanthemum flowers to someone who is sick (this act is a reminder of funerals), Not showering before entering a hot spring."],
     "context": [""]
    },
    {"tag": "Chatbot",
     "patterns": ["What is chatbot","Chatbot","Tell me about chatbot"],
     "responses": ["A chatbot is an intelligent piece of software that is capable of communicating and performing actions similar to a human. Chatbots are used a lot in customer interaction, marketing on social network sites and instantly messaging the client. There are two basic types of chatbot models based on how they are built; Retrieval based and Generative based models."],
     "context": [""]
    },
    {"tag": "japan_history",
     "patterns": ["can you tell me about japan history", "japan history","japanese history", "japan world wars","atomic bomb", "japan king","japan institution"],
     "responses": ["The prehistoric and ancient era of Japan covers the time up until 538 AD, including the Paleolithic (from 35,000 BC to 14,000 BC), Jomon (from 14,000 BC to 300 BC), Yayoi (from 300 BC to 250 AD), and Kofun (from 250 to 538) periods.The Classical Period opened with a big leap in the political, social, and artistic aspects of the Japanese society, including the fruition of the Yamato rule and the beginnings of Buddhism in Japan.Meanwhile, the nobles and elite adopted much of the Chinese culture, specifically fashion, writing and Buddhism.Closing out the Classical Japanese era is the Heian period, which started in 794 and ended in 1185, and saw the peak of Taoism, Buddhism, poetry, literature and art in Japanese society.Medieval Period (1185-1600).Kamakura period, the initial years of which saw the governance of Minamoto no Yoritomo, Kamakura's first shogun, along with the rise of the samurai warriors, caste system and feudalism;Muromachi or Ashikaga period, which covered the time of the Ashikaga or Muromachi rule (headed by their first shogun, Ashikaga Takauji) up until the early years of the Sengoku or Warring States period from 1465 to 1573, when the last shogun, Ashikaga Yoshiaka was cast out of Kyoto by daimyo Oda Nobunaga; and Azuchi-Momoyama period, which covered the ruling years of Oda Nobunaga and Toyotomi Hideyoshi (1573 to 1600) and laid the foundations to the formation of the Tokugawa shogunate.Modern Period (1600 -current).The establishment of the Tokugawa shogunate signified the commencement of Japan's modern period, which featured improvements in the overall social, political and economic stability of the country."],
     "context": [""]
    },
    {"tag": "introduction",
     "patterns": ["Tell me more about you", "What about you","Who are you", "You are chatbot", "Do you know who you are"],
     "responses": ["Sure, as you wish","I am a simple chatbot created by Nguyen Nam Cuong when he need some practical projects to prepare for finding a job when he just graduated from university."],
     "context": [""]
    },
    {"tag":"travel_japan",
    "patterns": ["can you tell me about travelling in japan","should i travel japan","travel in japan","travel japan","why i should travel japan","where is japan famous to travel","what is special about japan"],
    "responses": ["Japan is the most amazing tourist destination and it offers many unique experiences that you cannot find in any other part of the world.Even though many people think of Japan as a highly modern country with flashy neon lights and advanced technology, shopping malls and high-end stores, there are many ways in which Japan is a nature lover's paradise as well!As soon as you travel outside of the big and modern cities you will discover that the country is home to some of the best natural scenery in the world.Though, even if you are not keen on making your way to the summit, Mount Fuji is a sight to behold.Japan is amongst the safest countries in the world, with an extremely low crime rate.Japan is so safe, you can fall asleep on the train in Tokyo, the world's biggest city, and wake up with your wallet and phone still in your possession.Even though Japanese cuisine is available around the world, the country attracts millions of tourists every year just to experience authentic Japanese food. Some of the usual experiences are the sushi conveyor belt and sake bars and don't forget to try some fresh sushi at Tsukiji Fish Market or the delicious street food like takoyaki in Osaka.For many visitors, a trip to Japan provides the opportunity to indulge in some authentic Kaiseki food.Add to it a variety of traditional Japanese drinks and you have an experience of a lifetime waiting for you!There are an estimated 80,000 temples and shrines in Japan of all sizes and some are over 1,000 years old!The Buddhist temples and zen gardens are incredibly beautiful and if you enter them you really can experience how peaceful and magical these places actually are.Inari Shrines are the most familiar Shinto shrines to Japanese people and they are also known as o-inari-san.It is famous for its thousands of vermilion Torii gates and definitely something you have to see with your own eyes.Even if you are not visiting Kyoto, you will have the opportunity to visit shrines with rows of torii gates throughout the country, even in the centre of Tokyo!When you're visiting Japan you will quickly find out that Japanese behavior is completely different to how people behave in Western countries.The best part for international tourists is that they can purchase a Japan Rail Pass that will give them unlimited travel for a designated period of time throughout the country!Adventure tourism is not something that one would associate with Japan, but the truth is that you can find many exciting experiences in this country.Whether it is snowboarding or skiing in Hokkaido or Nagano, or cycling along the Seto Inland Sea, catching a glimpse of Mount Fuji from the rollercoasters of FujiQ Highlands or sand-boarding in Japan's desert of Tottori, the options for thrill-seekers are endless.With about 75% of Japan covered in mountainous landscape you can embark on some amazing multi-day hikes or walk the steps of ancient pilgrimage routes like the Kumano Kodo Trail or the Shikoku 88 Temples Pilgrimage and witness the perfect mixture of nature and culture.For gaming and anime lovers, shopping in Tokyo will be an unforgettable experience, Nakano would be the best destination for you.Square watermelons, washing toilets that blow-dry and play music, plastic food menus, cartoon versions and mascottes of everything, maid cafe etc, Japan has all kinds of unique things."],
    "context":[""]
    },
    {"tag":"fun_facts",
    "patterns": ["do you know any weird things about japan","fun facts about japan","fun facts"],
    "responses": ["Ritual suicide (known as seppuku) was a respected practice for a samurai who brought dishonor to his lord.The bow is an important form of greeting in Japan, and Japanese people work hard to perfect it.A single kimono can cost over $10,000.Geisha, known for their elaborate hairstyles and white makeup, have been entertaining in Japan since the 18th century.The white powder covers most of the geisha's face and neck, though unpainted spaces creating a W shape is usually left on the neck, which is considered alluring.Traditional Japanese rooms are tiled with Tatami, or mats made with rice straw.The motto for the Games is Discover Tokyo and the mascot—chosen by Japanese schoolchildren—is a blue and white superhero who has the power to teleport.Japan is famous for its immaculate gardens, which are meticulously planned and maintained and are considered a high art."],
    "context":[""]
    },
    {"tag":"children",
    "patterns": ["what about children in japan","children in japan","japanese children","japan children","can you tell me about japanese children","children"],
    "responses": ["From then on, these children live with great insecurity and access to their primary rights become quickly compromised.The case of child abuse is reaching a new record level in Japan.To remedy this, there exists a real need to train and sensitize the Japanese families.A strong discrimination exists in Japan concerning children's rights.They are yet to teach the children to respect one another and accept differences.In Japan, the university system is very elite.From nursery school, children work very hard until their entry into universities."],
    "context":[""]
    },
    {"tag":"educating",
    "patterns": ["japan educating","educating in japan","what about educating","can you tell me education of japan","educating","education"],
    "responses": ["Japan is one of the top-performing OECD countries in reading literacy, mathematics and sciences on Programme for International Student Assessment (PISA) tests with the average student scoring 520, compared with the OECD average of 488, placing it eighth in the world in the 2018 ranking. Japan's populace is well educated and its society highly values education as a platform for socioeconomic mobility and for gaining employment in the country's high-tech economy.Tertiary-educated adults in Japan, particularly graduates in sciences and engineering, benefit economically and socially from their education and skills in the country's high tech economy.Spending on education as a proportion of GDP is 4.1 percent, which is below the OECD average of 5 percent. Although expenditure per student is comparatively high in Japan, total expenditure relative to GDP remains small. In 2020, the country ranked third for the percentage of 25-to-64-year-olds that have attained tertiary education with 52.7 percent. In addition, 61.5 percent of Japanese aged 25 to 34 have attained some form tertiary education and bachelor's degrees are held by 31.3 percent of Japanese aged 25 to 64, the second most in the OECD after South Korea."],
    "context":[""]
    },
    {"tag":"military",
    "patterns": ["japanese military","what about military","military","military of japan","japan military","can you give information about japan military"],
    "responses": ["The Japan or Japanese Self-Defense Forces (JSDF), officially simply the Self-Defense Forces ( Jieitai; SDF) and also known as the Japanese Armed Forces, are the unified military forces of Japan. Established in 1954, the Self-Defense Forces include the Japan Ground Self-Defense Force, the Japan Maritime Self-Defense Force, and the Japan Air Self-Defense Force. They are controlled by the Ministry of Defense with the Prime Minister as commander-in-chief.In recent years, the SDF has engaged in international peacekeeping operations with the United Nations. Tensions with North Korea have reignited debate over the status of the SDF and its relationship to Japanese society.Since 2010, the SDF has refocused from countering the former Soviet Union to the People's Republic of China, and since the 2022 Russian invasion of Ukraine the SDF has also considered the Russian Federation a major threat;increasing military cooperation with Australia, India, Taiwan, South Korea, Singapore, the United Kingdom, and the United States, as well as acquiring new equipment and hardware."],
    "context":[""]
    },
    {"tag":"agriculture",
    "patterns": ["japan agriculture","agriculture","japanese agriculture","agriculture of japan","can you tell me about japan agriculture","can you give me information about ariculture"],
    "responses": ["In 2018, Japan produced 9.7 million tons of rice (13th largest producer in the world), 3.6 million tons of sugar beet (used to produce sugar and ethanol), 1.2 million tons of sugarcane (used to produce sugar and ethanol), 208 thousand tons of persimmon (4th largest producer in the world), 2.7 million tons of assorted vegetables, 3 million tons of potatoes, 1.3 million tons of cabbage, 1.6 million tons of onion, 773 thousand tons of tangerine, 756 thousand tons of apple, 764 thousand tons of wheat, 724 thousand tons of tomato, 612 thousand tons of carrot, 578 thousand tons of lettuce and chicory, 550 thousand tons of cucumber, 317 thousand tons of watermelon, 300 thousand tons of eggplant, 258 thousand tons of pear, 226 thousand tons of spinach, 211 thousand tons of soy, 197 thousand tons of pumpkin, 174 thousand tons of barley, 174 thousand tons of grape, 164 thousand tons of cauliflower and broccoli, 164 thousand tons of yam, 163 thousand tons of strawberry, 143 thousand tons of melon, 141 thousand tons of taro, 140 thousand tons of pepper, 113 thousand tons of peach, 112 thousand tons of apricot, in addition to smaller productions of other agricultural products."],
    "context":[""]
    },
    {"tag":"environment",
    "patterns": ["can you tell me about environment","japan environment","natural environment","environment in japan","what about environment"],
    "responses": ["Japan has also been actively protecting its environment since the 1970s and now has some of the world's most advanced strategies and technology in place to strike an ideal balance between development and environmental preservation."],
    "context":[""]
    },
    {"tag":"industry",
    "patterns": ["what about industry","japan industry","industry","industries","industry in japan","can you give information about japan industry"],
    "responses": ["Japan's major export industries include automobiles, consumer electronics (see Electronics industry in Japan), computers, semiconductors, copper, and iron and steel. Additional key industries in Japan's economy are petrochemicals, pharmaceuticals, bioindustry, shipbuilding, aerospace, textiles, and processed foods.The Japanese manufacturing industry is heavily dependent on imported raw materials and fuels. Japanese manufacturing and industry is very diversified, with a variety of advanced industries that are highly successful. Industry accounts for 30.1% (2017) of the nation's GDP. The country's manufacturing output is the third highest in the world. Well-known Japanese manufacturing and tech companies include Toyota, Nissan, Honda, Fujitsu, Yamaha, Epson, Toshiba, Sony, Panasonic, Nintendo, Sega, Nippon, Takeda Pharma, Mazda, Subaru, Isuzu, Mitsubishi Co, Komatsu, Sharp, Nikon, Canon, NEC and Hitachi are from Japan."],
    "context":[""]
    },
    {"tag":"adult_content",
    "patterns": ["adult content","japanese adult content","adult things","mature content"],
    "responses": ["Sorry. This's sensitive topic. You can search more information in google and make sure you're over 18 years old."],
    "context":[""]
    },
    {"tag":"politics",
    "patterns": ["Does Japan have stable politics","Is Japan safe to live","japan politics","japaense politics"],
    "responses": ["Politics of Japan are conducted in a framework of a dominant-party bicameral parliamentary constitutional monarchy, in which the Emperor is the head of state and the Prime Minister is the head of government and the head of the Cabinet, which directs the executive branch.Legislative power is vested in the National Diet, which consists of the House of Representatives and the House of Councillors. The House of Representatives has eighteen standing committees ranging in size from 20 to 50 members and The House of Councillors has sixteen ranging from 10 to 45 members.Judicial power is vested in the Supreme Court and lower courts, and sovereignty is vested in the people of Japan by the 1947 Constitution, which was written during the Occupation of Japan primarily by American officials and had replaced the previous Meiji Constitution. Japan is considered a constitutional monarchy with a system of civil law.Politics in Japan in the post-war period has largely been dominated by the ruling Liberal Democratic Party (LDP), which has been in power almost continuously since its foundation in 1955, a phenomenon known as the 1955 System. Of the 31 prime ministers since the end of the country's occupation, 24 as well as the longest serving ones have been members of the LDP. Consequently, Japan has been described as a de facto one-party state."],
    "context":[""]
    },
    {"tag":"government",
    "patterns": ["japan government","japanese government","what kind of japan governments"],
    "responses": ["The Constitution of Japan defines the Emperor to be the symbol of the State and of the unity of the people. He performs ceremonial duties and holds no real power. Political power is held mainly by the Prime Minister and other elected members of the Diet. The Imperial Throne is succeeded by a member of the Imperial House as designated by the Imperial Household Law.The chief of the executive branch, the Prime Minister, is appointed by the Emperor as directed by the Diet. They are a member of either house of the Diet and must be a civilian. The Cabinet members are nominated by the Prime Minister, and are also required to be civilian. With the Liberal Democratic Party (LDP) in power, it has been convention that the President of the party serves as the Prime Minister."],
    "context":[""]
    },
    {"tag":"religion",
    "patterns": ["japan religion","japanese religion","can you list all japanese religion","do japanese people prey any religion"],
    "responses": ["There are two dominant religions in Japan: Shinto and Buddhism. Neither of them has a clear definition of God and the judgment day. Shintoism does not even have any holy book or the concept of sin. So, in a Western sense, Japanese religions are more like traditions rather than holy belief systems. Shintoism is Japan's own religion where some natural objects are considered sacred but not necessarily worshipped as gods. Buddhism proposes that everyone can become a Buddha (the enlightened human) if he/she leaves worldly desires and lives a simple life. Japanese people traditionally go to both Buddhist temples and Shinto shrines; so they are both Shintoist and Buddhist. "],
    "context":[""]
    },
    {"tag":"lifestyle",
    "patterns": ["minimalist lifestyle","live in japan","lifestyle in Japan"," Japanese lifestyle","Japan lifestyle"],
    "responses": ["Jazz, rock, and the blues are enjoyed by the generations of Japanese who were born after World War II, along with half-Westernized or half-Japanized folk and popular songs. In rural agricultural areas, women have growing responsibilities in running agricultural operations, since many male heads of household are engaged in full-time employment in manufacturing facilities often at some distance from the family farm.Entertaining typically is not done at home, in part because of the small size of most Japanese homes and also because much of it is business-related.","Japanese minimalism is a concept that focuses on keeping life simple, clean, and uncluttered by living with just the essentials. It's inspired by the aesthetic of Japan's traditional Zen Buddhism and can be seen in many different facets of everyday life, from their architecture to fashion choices."],
    "context":[""]
    },
    {"tag":"festivals",
    "patterns": ["what festivals are famous in japan","what special festivals in japan","japan festivals","japanese festivals","any special festivals"],
    "responses": ["Japan hosts more than 200,000 local festivals throughout the year. Many visitors from all over Japan and abroad often come to see the Kyoto Gozan no Okuribi, where flaming kanji characters appear on the mountains of Kyoto, as well as Tohoku's impressive Aomori Nebuta Festival. Gorgeous floats are the highlights of Chichibu Night Festival in Saitama and Takayama Festival in Gifu. If you want to enjoy some perfectly coordinated dancing, make sure you check out the Tokyo Koenji Awa Odori and Okinawa Zento Eisa Matsuri events. You can also enjoy browsing the stalls at Tori no Ichi in Yokohama or immerse yourself in the otherworldly atmosphere at the Nagasaki Lantern Festival. There are fascinating seasonal festivals taking place all over Japan, so you'll be able to find something to celebrate no matter which part of the country you're visiting. The most famous Japanese festivals are: Gion Festival in Kyoto, Awa Odori Festival, Nebuta Festival in Aomori."],
    "context":[""]
    },
    {"tag":"technology_science",
    "patterns": ["japanese technology","japan technology","what japan technology","technologies","japan technologies","japan science"],
    "responses": ["Japan has a long history and tradition for scientific research and development, stretching as far back as the Meiji period.However, science and technology developed rapidly after the Second World War, which has affected the advancement of vehicle technology, consumer electronics, robotics, medical devices, space exploration, and the film industry."],
    "context":[""]
    },
    {"tag":"progress",
    "patterns": ["japanese science progress","science progress","invention of Japan"],
    "responses": ["They contribute a lot of inventions for the world in many fields for example Aerospace research, Nuclear energy, Electronics,Robotics,Medicine and healthcare","Ten Japanese Great Inventors: Sakichi Toyoda,Kokichi Mikimoto,Jokichi Takamine,Kikunae Ikeda,Umetaro Suzuki,Kyota Sugimoto,Kotaro Honda,Hidetsugi Yagi,Yasujiro Niwa,Tokushichi Mishima"],
    "context":[""]
    },
    {"tag":"geography",
    "patterns": ["geography","japan geography","geography of japan","geographic"],
    "responses": ["Japan is an archipelagic country comprising a stratovolcanic archipelago over 3,000 km (1,900 mi) along the Pacific coast of East Asia. It consists of 14,125 islands.The territory covers 377,973.89 km2 (145,936.53 sq mi). It is the fourth largest island country in the world and the largest island country in East Asia. The country has the 6th longest coastline at 29,751 km (18,486 mi) and the 8th largest Exclusive Economic Zone of 4,470,000 km2 (1,730,000 sq mi) in the worldThe five main islands are Hokkaido, Honshu, Kyushu, Shikoku and Okinawa. The other 14,120 islands are classified as remote islands by the Japanese government. The Ryukyu Islands and Nanpo Islands are south and east of the main islands."],
    "context":[""]
    },
    {"tag":"teenagers",
    "patterns": ["teenagers in japan","japanese teenagers","japan teenagers","what about teenagers","can you tell me about teenagers"],
    "responses": ["Tokyo is an amazing city with so much to see and do. It can be overwhelming for first-time visitors, but with a little planning, it can be a great trip for the whole family. Tokyo with teenagers is an amazing destination full of surprises.There are plenty of activities in Tokyo with teenagers, from exploring the city to visiting theme parks, the city is safe and easy to get around. Tokyo is also a great place to learn about Japanese culture and history. And, of course, there are plenty of famous anime and manga stores!"],
    "context":[""]
    },
    {"tag":"japan_music",
    "patterns": ["what about japan music","what about music","japanese music","japan music","all kind music","can you tell me about japan music"],
    "responses": ["Japan is the world's largest market for music on physical media and the second-largest overall music market, with a retail value of US$2.7 billion in 2017. Japan has lots kind of musics,  for example with traditional music, we have Gagaku, hougaku; Biwa hoshi, Heike biwa, Wadaiko,Okinawan folk music,Min'yo folk music, or with western music, they are Japanese blues/Enka and Western classical music. With popular music, we have J-pop,Idol music,Dance and disco music,Rock,Punk rock,Heavy metal,Kawaii Future Bass,Synth-pop and club music,Hip hop,Roots and country music,Theme music and Game music"],
    "context":[""]
    },
    {"tag":"japan_movie",
    "patterns": ["japan movie","cinema in japan","japanese movie","moive","film","cinema","what about movie","movies"],
    "responses": ["The cinema of Japan ( Nihon eiga, also known domestically as hoga, domestic cinema) has a history that spans more than 100 years. Japan has one of the oldest and largest film industries in the world; as of 2021, it was the fourth largest by number of feature films produced. In 2011 Japan produced 411 feature films that earned 54.9% of a box office total of US$2.338 billion. Films have been produced in Japan since 1897, when the first foreign cameramen arrived.Tokyo Story (1953) ranked number three in Sight & Sound critics' list of the 100 greatest films of all time.Tokyo Story also topped the 2012 Sight & Sound directors' poll of The Top 50 Greatest Films of All Time, dethroning Citizen Kane, while Akira Kurosawa's Seven Samurai (1954) was voted the greatest foreign-language film of all time in BBC's 2018 poll of 209 critics in 43 countries.[9] Japan has won the Academy Award for the Best International Feature Filmfive times, more than any other Asian country. Japan's Big Four film studios are Toho, Toei, Shochiku and Kadokawa, which are the only members of the Motion Picture Producers Association of Japan (MPPAJ). The annual Japan Academy Film Prize hosted by the Nippon Academy-sho Association is considered to be the Japanese equivalent of the Academy Awards"],
    "context":[""]
    },
    {"tag":"famous_people",
    "patterns": ["Can you list top japanese famous people","famous people","top famous people","japanese famous people","success people","success person","tell me about success people","japan success people","japanese success people"],
    "responses": ["Sure. We can go through some famous people for example: Hayao Miyazaki- Animation Director, Ken Watanabe- Actor, Hiroyuki Sanada -Actor, Haruki Murakami- Writer, Shinji Kagawa -Professional Footballer,Yoko Ono- Artist,Marie Kondo- Author & Organizing Expert,Mari Osaka- Professional Tennis Player,Naoko Takeuchi - Manga Artist,Akira Kurosawa- Film Director,Akira Kurosawa- Japanese Filmmaker,Hideo Kojima - Game Director"],
    "context":[""]
    },
    {"tag":"hot_spring",
    "patterns": ["hot spring in japan","what special hot spring","hot spring","hot water","hot pool"],
    "responses": ["Thanks to its overabundance of active volcanos, Japan is a veritable hotbed of hot springs. Warm, mineral-rich waters bubble up from beneath the earth all over the country, giving rise to spa precincts with charming ryokan (traditional Japanese inns). In small towns, the community gathers at bathhouses to chat, relax and wallow in geothermally heated water, as people did in ancient Rome.To be classed as an onsen, an establishment's water must contain at least one of 19 minerals, such as iron, sulphur or hydrogen carbonate, and be naturally warmer than 25 degrees Celsius. Generally bathing is done naked and often in gender-segregated baths (scroll down for etiquette tips). According to the Nippon Onsen Research Association, there are more than 3000 onsens in Japan. Here are some of our favourites. We can list some famous hot spring in some province for example : Fukushima,Kyoto,Hakone,Matsuyama,Akita and Tokyo"],
    "context":[""]
    },
    {"tag":"japan_art",
    "patterns": ["can you recommend any famous japanese arts","what arts are japan famous for","japan arts","japanese arts"],
    "responses": ["Sure. Japanese arts can be traced back to the indigenous populations who roamed the main island thousands of years ago. The pottery vessels made by the Jomon 12,000 years ago are considered as the oldest in the world. Later, the Japanese arts were influenced by Buddhism and Chinese culture. The earliest forms of Buddhist statues and monochrome paintings at temples show resemblance to the Chinese arts. However, many unique forms of art, such as ikebana, ukiyo-e and kabuki, started emerging when the influence of China started diminishing after the rise of the samurai class in the 10th century.  "],
    "context":[""]
    },
    {"tag":"japan_disater",
    "patterns": ["what disaster in japan","typhoon","tsunami","disaster in japan","disater","calamity","earthquake","calamity in japan","nuclear disaster"],
    "responses": ["Japan is an island country and as a result, it's usually be affected by many natural disasters or even artifical disaster we can list as following: The Fukushima nuclear disaster, 2011 Tohoku earthquake and tsunami, a plenty small and big earthquakes, typhoons happen usually due to volcano and geological strata activities."],
    "context":[""]
    },
    {"tag":"food",
    "patterns": ["sushi","sashimi","gohan","sukiyaki","tempura","tonkatsu","yakisoba","takoyaki","toriyaki","yakiniku","food in japan","chazuke"],
    "responses": ["That's all special and typical food in Japan. If you want to know more, please talk to me by keyword cuisine or japanese cuisine."],
    "context":[""]
    },
    {"tag":"anime_song_recommend",
    "patterns": ["can you recommend any anime songs","anime songs","suggest anime songs","recommend anime song","top anime songs"],
    "responses": ["Sure. If you love anime songs in the 90s, 2000 period, there are some songs for you:Cha-La Head-Cha-La (Dragon Ball Z), Pokémon Theme (Pokémon),Theme from Lupin The Third (Lupin The Third), Moonlight Densetsu (Sailor Moon), Tobira Wo Akete (Ost Card Captor Sakura), Doraemon No Uta (Doraemon).And if you like anime songs for now, I can recommend some anime songs as following: Gurenge ( Kimetsu no Yaiba), Unravel (Tokyo Ghoul), Akuma no Ko(Attack on Titan)"],
    "context":[""]
    },
    {"tag":"anime_recommend",
    "patterns": ["can you recommend any anime movie","anime movie","animation","recommend anime","anime suggest","suggest anime","top anime"],
    "responses": ["OK. Here's what you may like: Kimetsu no Yaiba, Attack on Titan, Boruto, One Punch Man, Tokyo Ghoul, Sword Art Online and even a lot a lot famous anime movies you shouldn't miss if you're a fan."],
    "context":[""]
    },
    {"tag":"movie_recommend",
    "patterns": ["can you recommend any movies","recommend movies","japanese movies","japan movie suggest","suggest movie","top movie"],
    "responses": ["Certainly! I can list for you some top Japanese movies as following: Spirited Away,Princess Mononoke, Howl's Moving Castle ,My Neighbor Totoro,  Your Name, Ghost in the Shell. If you want reality movies or real life movies results, we can have: Run for the Money,  Iron Chef , Ariyoshi Assists,Ultimate Beastmaster, Love is Blind: Japan, Terrace House or Documental."],
    "context":[""]
    },
    {"tag":"gravure",
    "patterns": ["gravure","underwear idol","underwear","sexy idol","can you give me information about gravure","japanese models"],
    "responses": ["If you are under 18 years old, please stop searching and avoid this topic. Gravure idols who are glamour models in Japan that are generally more provocative than regular models and idols, though not to the point of posing nude. If you're over 18, here's some top gravure idols I can list :Rena Takeda, Nanoka, Risa Yoshiki, Anri Sugihara, Ayaka Sayama, Asuka Kishi, Osawa Reimi, Hinako Sano. "],
    "context":[""]
    },
    {"tag":"actors_recommend",
    "patterns": ["can you recommend some actors","recommend actors","suggest actors","top actors","japanese actors"],
    "responses": ["Here's some actors you may like: Kimura Takuya, Kagawa Teruyuki, Watanabe Ken, Matsumoto Jun, Oguri Shun, Takahashi Issei , Satoh Takeru, Yamashita Tomohisa, Matsuyama Kenichi , Sometani Shota , Okada Masaki."],
    "context":[""]
    },
    {"tag":"actress_recommend",
    "patterns": ["can you recommend some actress","recommend actress","suggest actress","top actress","japanese actress"],
    "responses": ["If you watch Japanese media, whether it is film or television, you would have certainly come across a few of these actresses. Their striking beauty and talented performances have won over many fans. Here are some of the most beautiful and popular actresses to come out of Japan. Is your favorite on the list? Kasumi Arimura, Hikari Mitsushima, Nanao Arai, Mikako Tabe, Marie Iitoyo, Yuna Taira, Sayaka Isoyama, Minami Hamabe, Meisa Kuroki,  Yui Aragaki, Aya Ueto, Yuriko Yoshitaka."],
    "context":[""]
    },
    {"tag":"artist_recommend",
    "patterns": ["what about artists","can you recommend some artists","recommend artist","suggest artist","top artist","japanese artists"],
    "responses": ["Here's some mixed time periods artists you may like: Yokoyama Taikan, Yayoi Kusama, Hokusai, Utagawa Hiroshige, Tsuguharu Foujita, Tawaraya Sotatsu, Chiharu Shiota, Kawase Hasui, Sesshu Toyo, Tetsuya Ishida. "],
    "context":[""]
    },
    {"tag":"manga_recommend",
    "patterns": ["can you recommend manga","can you recommend comic","recommend manga","do you suggest any manga","do you suggest any comic"],
    "responses": ["OK. I can list some top manga as following: One Piece , Demon Slayer , Slam Dunk , Detective Conan, Dragon Ball , Attack on Titan, Naruto, Haikyu!!"],
    "context":[""]
    },
    {"tag":"singer_recommend",
    "patterns": ["what about singers","can you recommend some singer","recommend singer","suggest singers","top singer","japan singer","japanese singers"],
    "responses": ["Sure. I can list some top singers as following: Yoko Ono, Suzuka Nakamoto, Hikaru Utada, Meiko Kaji, Koji Tamaki, Hiroshi Kamayatsu, Miyavi, Ayumi Hamasaki, Sakura Miyawaki, Takahiro Moriuchi, Damo Suzuki, LiSa, Koji Wada."],
    "context":[""]
    },
    {"tag":"games_recommend",
    "patterns": ["what about games","can you recommend some game","recommend game","suggest game","top game","japanese games"],
    "responses": ["Sure. Here's some games I recommend for you: Pokémon Scarlet/Violet, Kirby and the Forgotten Land , Splatoon 3, Mario Kart 8 Deluxe, Elden Ring, Monster Hunter Rise , Dragon Quest X, Gran Turismo 7, The Legend of Zelda: Breath of the Wild , Demon Slayer -Kimetsu no Yaiba, Xenoblade Chronicles 3 , Horizon Forbidden West, Nier:Automata/Replicants, Nioh,Bayonetta 3, Final Fantasy VII Remake"],
    "context":[""]
    },
    {"tag":"TV_show_recommend",
    "patterns": ["what about tv show","can you recommend some tv show","recommend tv show","suggest tv show","top tv shows","japanese tv shows"],
    "responses": ["Sure. I can list some top tv shows as following: Alice in Borderland, The Many Faces of Ito, Japan Sinks: People of Hope, Fishbowl Wives, Good Morning Call."],
    "context":[""]
    },
    {"tag":"documentary_movie_recommend",
    "patterns": ["what about documentary","can you recommend some documentary","recommend documentary","suggest documentary","top documentary","japanese documentary"],
    "responses": ["Yeah. I can list some documentaries as following:  Tokyo Olympiad (1965), A.K.A. Serial Killer (1969), The Cherry Tree with Gray Blossoms (1977), A Japanese Village (1982), The Emperor's Naked Army Marches On (1987), Embracing (1992), Without Memory (1996), Campaign (2007), Thus a Noise Speaks (2010)."],
    "context":[""]
    },
    {"tag":"adult_actress_recommend",
    "patterns": ["what about adult actress","can you recommend some adult actress","recommend adult actress","suggest adult actress","top adult actress","japanese adult actress"],
    "responses": ["If you are under 18, please avoid and stop searching this topic immediately. If you're over, here's some actress'names you may want to know: Saki Kawashita, Yua Mikami, Rare Anzai, Shoko Takahashi, Hana Himesaki, Momo Sakura, Mei Satsuki, Yu Shinoda, Nao Jinguji, Aka Asuka, Ichika Matsumoto, Riho Fujimori, JULIA, Arina Hashimoto, Yume Nikaido."],
    "context":[""]
    },
    {"tag":"society_vices",
    "patterns": ["any society vices","any negative cases","criminals","crimes","criminal in japan","prostitution","red light street","any drugs","is adult movies bad","killing","suicide","suicidal"],
    "responses": ["Of these, the arrest rate for cases involving murder, robbery, arson, rape, sexual assault, indecent assault, kidnapping, and human trafficking, which are designated as major crimes, was 93.4%.As of 2001, Japan has a conviction rate of over 99.8%, even higher than contemporary authoritarian regimes. Scholars say the biggest reason for Japan's very high conviction rate is the country's low prosecution rate and the way Japan calculates its conviction rate is different from other countries. According to them, Japanese prosecutors only pursue cases that are likely to result in convictions, and not many others. According to Professor Ryo Ogiso of Chuo University, prosecutors defer prosecution in 60% of the cases they receive, and conclude the remaining 30% or so of cases in summary trials."],
    "context":[""]
    },
    {"tag":"japanese_girls_comment",
    "patterns": ["can you recommend any japanese girls","comment about japanese girls","japan girl","japanese girls","girls in japan"],
    "responses": ["Japanese girls are beautiful and admired worldwide for their youthful beauty. They have dark and silky hair porcelain skin, and you will find some of the most attractive girls in Japan. They have leveled up the beauty game for centuries, and their skin care and beauty routines are famous worldwide."],
    "context":[""]
    },
    {"tag":"weeboo",
    "patterns": ["what is weeboo","weeboo","can you tell me about weeboo","are you weeboo","you are weeboo"],
    "responses": ["What does weeaboo mean? Weeaboo is a mostly derogatory slang term for a Western person who is obsessed with Japanese culture, especially anime, often regarding it as superior to all other cultures. If you don't satisfy with this response, please search in google instead."],
    "context":[""]
    },
    {"tag":"otaku",
    "patterns": ["what is otaku","otaku","can you tell me otaku","what about otaku","are you otaku","you are otaku"],
    "responses": ["Otaku is a Japanese word that describes people with consuming interests, particularly in anime, manga, video games, or computers. If you search any key words anime, manga, doujinshi or some kinds like that, you are real otaku. For me, otaku are not bad guys, but you should be careful and think twice everytime you want to spend your money in video games, animes, mangas or figures. It's very dangerous and might make you can not escape."],
    "context":[""]
    },
    {"tag":"doujinshi",
    "patterns": ["what is dojinshi","what about dojinshi","can you tell me about dojinshi","dojinshi","japan dojinshi"],
    "responses": ["Doujinshi, also romanized as dojinshi, is the Japanese term for self-published print works, such as magazines, manga, and novels. Part of a wider category of doujin (self-published) works, doujinshi are often derivative of existing works and created by amateurs, though some professional artists participate in order to publish material outside the regular industry."],
    "context":[""]
    },
    {"tag":"japanese_women",
    "patterns": ["what about japanese women","japanese women","women in japan","japan women","can you tell me about japanese women"],
    "responses": ["At first, we have to start with Later marriages and more divorces, because Economic factors such as rising income levels and the shift to an industrial economy which opened many new employment opportunities for female workers, have made it much easier for women to make a life for themselves outside the framework of marriage. Secondly, Causes and effects of the declining birthrate, Not only are women marrying later, but when they do marry they are having fewer children. In the early postwar years, the average Japanese woman gave birth to four children. By 1989 the number of births per woman had plummeted to 1.57. That set off a virtual panic among the male political leaders. Serious attention was focussed on the declining birthrate yet the average has continued to fall, reaching 1.43 in 1995. Thirdly, Career women encounter the glass ceiling, More and more manufacturers, for example, are taking steps to make it possible for women to do blue-collar jobs which were once reserved only for men. To open factory doors to women, some manufacturers have eased the physical requirements by partially automating their operations. Fourthly, What women want fixed is the office environment.Finally, How Japanese men look upon women, Men in older age groups have full time housewives and have not had women as classmates in their college days. For them, women and children form a single group in need of a man's protection. In contrast, younger men are accustomed to women classmates and women classmates who do better than they do in school. "],
    "context":[""]
    },
    {"tag":"tradition",
    "patterns": ["what about tradition","japanese tradition","tradition","tradition in japan","can you tell me about japanese tradition","japan tradition"],
    "responses": ["Since harmony is very important in Japan, there are many customs, traditions and etiquette rules  to create social bonding between people. Some of the interesting traditions that surprise foreigners are:Taking off shoes when entering someone's house, Wearing a mask when sick, Not shaking hands and not hugging when meeting with loved ones, Bowing 45 degrees to show respect,Making the slurping sound when eating noodles, Symbolically washing hands when entering a shrine,Wearing slippers when using the restroom, Decorate one's house with dolls for the annual girls day and decorate the house with the samurai figure for the annual boys day, Throwing beans at people who dressed as demons during the setsubun festival, Eating a special meal called osechi during the new year's day, Bathing in the evening rather than in the morning, Participating in the firework festivals or bon odori festivals during the summer by wearing a yukata."],
    "context":[""]
    },
    {"tag":"traditional_jobs",
    "patterns": ["what is traditional jobs in japan","japan traditional job","traditional jobs","japanese traditional jobs","what about tradtional job"],
    "responses": ["There are some Japanese traditonal/ancient jobs such as: Fishermen, Gatherers and Farmers Equipment,Artists Equipment, Artists, Ink Making, Clothes Making, Wine making and even more."],
    "context":[""]
    },
    {"tag":"handicraft",
    "patterns": ["what about japan handicraft","japan craft","japanese craft","japan handicraft"],
    "responses": ["Traditional crafts in Japan have a long tradition and history. Included in the category of traditional crafts are handicrafts produced by an individual or a group, as well as work produced by independent studio artists working with traditional craft materials and/or processes. They are made from or made with many marterials such as ceramics, textiles, Lacquerware, Wood and bamboo, Metal(sword katana making),Dolls,Paper making,.."],
    "context":[""]
    },
    {"tag":"traditional_manners",
    "patterns": ["can you tell me about traditional manners of japan","traditional manners","tradition manners"],
    "responses": ["Certainly! Japanese people always display modesty and humility. People often bow to convey the message: I am not above you. I respect you. Bowing longer with a higher degree of angle means more respect. Additionally, Japanese people have two religions at the same time: they are both Buddhist and Shintoist. When a Japanese baby is born, the ceremony is held in the Shinto shrine and when someone dies the ceremony takes place in a Buddhist temple. Lastly, in Japan, people are obsessed with hygiene: they take off their shoes when entering someone's house and take a bath almost everyday. Many foreigners are surprised that there are no trash cans in public areas but everywhere is still clean. "],
    "context":[""]
    },
    {"tag":"japan_architectures",
    "patterns": ["architecture","japan architecture","what about architecture","japanese architecture","can you give me information of japan architecture"],
    "responses": ["Japanese architecture is similar to that of other East Asian countries. Japanese buildings tend to be simple with dull colors as a result of the zen philosophy. The temples, shrines and private houses are traditionally made out of wood. Most structures have elevated basements and big roofs because of high humidity and frequent rains throughout the year. The roofs also have curves at the corners that provide more light in the winter and more shadow during the winter. Rooms are separated by light wooden screens (fusuma) or paper windows (shoji) that can be easily moved when seasons change. Visitors of Japan are surprised by the green mats set on floors (tatami) which are made out of plant straws."],
    "context":[""]
    },
    {"tag":"currency",
    "patterns": ["what about currency","yen","japan currency","japan money","japanese currency"],
    "responses": ["The yen had appreciated to a peak of ¥271 per US$ in 1973, then underwent periods of depreciation and appreciation due to the 1973 oil crisis, arriving at a value of ¥227 per US$ by 1980. Since 1973, the Japanese government has maintained a policy of currency intervention, so the yen is under a dirty float regime."],
    "context":[""]
    },
    {"tag":"finance",
    "patterns": ["japan finance","japanese finance","finance in japan","finance of japan"],
    "responses": ["In the first decades after World War II, Japan's complex financial system was significantly different from that of other developed countries in several respects, most notably in the major role played by banking and the relatively minor position of securities."],
    "context":[""]
    },
    {"tag":"bank",
    "patterns": ["japanese bank","japan bank","banking","what about bank","japanese banks","bank","can you tell me about japan banks"],
    "responses": ["There are also a number of trust banks and long-term credit banks, some government financial institutions—including the Japan Bank for International Cooperation, the Japan Finance Corporation for Small and Medium Enterprise, and the Development Bank of Japan—several dozen foreign banks, and many mutual savings and loan banks and credit associations."],
    "context":[""]
    },
    {"tag":"internal_trade",
    "patterns": ["what about internal trade","internal trade","domestic trade","japan internal trade"],
    "responses": ["Japan has a long-established and complex system of wholesale distribution and retail marketing, characterized by numerous intermediary levels in the distribution of goods and small, often family-run retail outlets. This system, for years threatened by Japan's large department stores, also has been challenged by the growth of supermarket and discount-store chains and by mail-order sales and, more recently, online commerce. Sales traditionally have been transacted in cash, but the use of charge accounts and credit cards has become widespread."],
    "context":[""]
    },
    {"tag":"import",
    "patterns": ["what about imports of japan","japan imports","imports","japanese imports","import"],
    "responses": ["After World War II, Japan established relatively high tariffs and instituted restrictive nontariff barriers for many products in order to protect domestic markets. Consistently high trade surpluses led to mounting pressure by Japan's trading partners—notably the United States—for Japan to open its domestic market to foreign goods."],
    "context":[""]
    },
    {"tag":"export",
    "patterns": ["what about exports of japan","japan exports","exports","japanese exports","export"],
    "responses": ["An outstanding feature of Japan's economic development after World War II was the rapid advance in overseas sales, even though the share of exports in the country's gross national product generally remained relatively constant. Textiles and food products constituted a considerably decreased share of total exports, while exports of a wide variety of machinery and apparatuses (including electronic equipment and components) and transport equipment grew dramatically, together accounting for the largest proportion of exports."],
    "context":[""]
    },
    {"tag":"labour_taxation",
    "patterns": ["what about tax","japan tax","taxation","japan labour","japanese tax"],
    "responses": ["Because Japanese trade unions were generally organized on a plant or enterprise basis, their number was relatively large, and in many cases there were different organizations for different plants of the same company. The great majority of the enterprise unions became affiliated to federations that were loosely organized on craft lines, such as the Confederation of Japan Automobile Workers' Unions (Jidosha Soren)."],
    "context":[""]
    },
    {"tag":"roads",
    "patterns": ["road in japan","japan roads","japan road","what about japan roads"],
    "responses": ["Feudal towns, especially fortified (castle) towns, may have somewhat similar street patterns, though in many cases these are modified (generally in the form of concentric rings) to follow former defensive lines. Japan has an extremely high density of motor vehicles per unit area in the plains and in other inhabited areas."],
    "context":[""]
    },
    {"tag":"illness",
    "patterns": ["japan illness","japanese illness","pandemic","illness","illness in japan"],
    "responses": ["The three major diseases in Japan that have been the leading causes of death since the 1950s are cancer , heart disease , and cerebrovascular disease (CVD) . In an aging society, it is desirable to comprehensively estimate the social burden of disease, including indirect and LTC costs, when estimating healthcare demand as a reference for formulating health policy.Disability Adjusted Life Years (DALYs) are well-known estimates of the social burden of disease."],
    "context":[""]
    },
    {"tag":"health",
    "patterns": ["japan health","health care in japan","japan health care","health care","what about health"],
    "responses": ["Japan has a high standard of living, which contributes much to the general good health of the Japanese people. The country has one of the most comprehensive health care systems in the world, with national health insurance covering all citizens. Malignant neoplasms (cancers) have been the leading cause of death in Japan since about 1980; Although Japanese per capita consumption of calories and fat is generally lower than that of Europeans or Americans, many more Japanese are overweight now than in the past."],
    "context":[""]
    },
    {"tag":"visa_issuance",
    "patterns": ["visa issuance","how i get visa issuance","visa","i need visa issuance","can you give me information of visa issuance"],
    "responses": ["You should remember some things as following to get Japanese visa issuance: 1. Lifting of suspension of visa validity, 2. Resumption of visa exemption arrangement ,3. Review on border restrictions on new entry of foreign nationals."],
    "context":[""]
    },
    {"tag":"welfare",
    "patterns": ["japan welfare","japanese welfare","welfare","welfare in japan","what about welfare","can you tell me about japan welfare"],
    "responses": ["Programs include social insurance (health insurance, pension insurance, unemployment insurance, and worker's accident compensation insurance), services for the elderly and the physically and mentally handicapped, and care for disadvantaged children. for example, medical care services are free to expectant mothers and to young children from low-income families. Employers and employees bear most of the costs of pension and health care plans for working people and their families, but the costs of most other social welfare programs are shouldered by national and local governments."],
    "context":[""]
    },
    {"tag":"customer_service",
    "patterns": ["customer service in japan","service in japan","japan services","services","what about customer service"],
    "responses": ["In Japan, though, the majority, 56 percent, of the respondents said that after one case of bad customer service, they'll simply spend their money somewhere else from then on.Taken from the perspective of a business owner, a single service screw up means you can probably kiss that customer goodbye permanently, so employee training and work process management has to make service a priority if the business is going to have any chance of succeeding."],
    "context":[""]
    },
    {"tag":"reputation",
    "patterns": ["reputation of japan","japan reputation","what about japan reputation","reputation"],
    "responses": ["Japan has emerged the country with the best reputation in the world in a new report that drops the traditional paradigm of GDP growth as the yardstick for global status, in favor of factors like a country's values system, quality of life and heritage and culture. In the FutureBrand Country Index 2019 report, Japan outranked the 74 other countries studied (pre-selected from the World Bank's top 75 countries), with authors attributing its success to everything from natural beauty, culture, gastronomy to its international exports be it Muji, Uniqlo to Marie Kondo."],
    "context":[""]
    },
    {"tag":"eating_manners",
    "patterns": ["what about eating manners","eating manners","japan eating manners"],
    "responses": ["Sure, Japanese eating manners includes: Making the slurping sound when eating noodles,Eating a special meal called osechi during the new year's day"],
    "context":[""]
    },
    {"tag":"human_resource",
    "patterns": ["japan human resource","human resource","human resources","human resource managing","can you tell me about human resource"],
    "responses": ["The ever-complex labour market in Japan has seen a significant number of challenges in recent times, such as a rapidly ageing population that has contributed to a chronic and crippling shortage of labour; But on the bright side, Japan's unemployment rate has remained at an all-time low, although it recently saw a spike which also harkens good news as more jobseekers enter the market. One of the most positive developments however, has been the implementation of a new labour law that aims to transform Japan's notorious culture of overworking"],
    "context":[""]
    },
    {"tag":"employee_life",
    "patterns": ["employee life in japan","work in japan","work environment","worker in japan","japan employee","employee life"],
    "responses": ["Mandatory employee benefits in Japan include retirement, several types of disability pensions, workers compensation and unemployment insurance, healthcare, long-term care, paid leaves, and contribution to the longevity healthcare system. Common supplementary employee benefits include life, personal accident, long-term disability, medical top-up, annual health checks, condolence benefits, housing, commuting, and family allowances. Common perks include food service, discounts on education and entertainment, and flextime."],
    "context":[""]
    },
    {"tag":"employee_recruitment",
    "patterns": ["employee recruitment","recruit employee","recruitment in japan","japan employee recruitment","what about job recruit","recruit job","job market"],
    "responses": ["It's essential to have an understanding of typical workplace culture and general etiquette before you begin the process of recruiting talent in Japan. Keeping the following guidelines in mind will help ensure that the recruitment process is as smooth as possible for you and your international staff. 1. Give Formal Greetings 2. Respect Privacy 3. Be Punctual 4. Appreciate the Value of Collectivism"],
    "context":[""]
    },
    {"tag":"employee_treatment",
    "patterns": ["employee benefits","employee treatment","japan worker benefit","worker benefit","japan employee benefit"],
    "responses": ["Japanese candidates tend to be picky when it comes to choosing a company to work for.It is advised that new market entrants seeking their first hires to invest more in benefit packages and their brand building to help attract and secure talent.In Japan, employees are expected to work hard and demonstrate strong loyalty and devotion to the firm, in exchange for some degree of job security and benefits, such as housing subsidies, good insurance, the use of recreation facilities, and bonuses and pensions.Wages begin low, but seniority is rewarded, with promotions based on a combination of seniority and ability.Leadership is not based on assertiveness or quick decision making but on the ability to create consensus, taking into account the needs of subordinates.Surveys indicate continued preference for bosses who are demanding but show concern for workers' private lives over less-demanding bosses interested only in performance on the job.This system rewards behaviour demonstrating identification with the team effort, indicated by singing the company song, not taking all of one's vacation days, and sharing credit for accomplishments with the work group.Pride in one's work is expressed through competition with other parallel sections in the company and between one's company and other companies in similar lines of business.The image of group loyalty, however, may be more a matter of ideology than practice, especially for people who do not make it to the top."],
    "context":[""]
    },
    {"tag":"company culture",
    "patterns": ["company culture","japan company culture","japanese company culture","workplace culture","what about company culture","company culture in japan"],
    "responses": ["And while there have been notable changes in Japanese work conditions, Japan is still a hard working country.In 2015, an Expedia Japan survey found that 53% of Japanese people don't know about how much annual leave they have.While they managed to surpass many Western economies and become the world's second largest economy after World War II, the workforce developed the habit of overworking.Secondly, the collectivist culture prevalent at the time expected workers to prioritize the company over themselves.Despite the issues mentioned above, Japan can be a great place to work! It endeavors to lower the number of employees working 60+ hours per week and hopes that they take at least 70% of their paid holiday leave.Now that you've seen the impressive progress in combating karoshi and changing the Japanese work culture, here are six advantages of working in Japan to better convince you to find a job in the country! 1. Companies pay your transportation expenses 2. Health insurance 3. Employment stability 4. Skills upgrading 5. Renewed business culture 6. High demand in the Tech Industry"],
    "context":[""]
    },
    {"tag":"workplace_manners",
    "patterns": ["workplace manners","company manners","japan workplace manners","workplace manners in japan"],
    "responses": ["While there are likely more than the unspoken rules of manners and etiquettes listed below, here are 11 important things to remember when conducting business meetings in Japan: 1. Be early 2. Be prepared 3.Prepare business cards 4. Mind your clothes 5. Wait for your seat 6. Accept the snacks 7. Be attentive 8. Give out compliments but be modest 9. Respect age and status 10. Do not pressure 11. Bow as a sign of respect. 12.Prepare for company drinking parties and learn say no as much as possible." ],
    "context":[""]
    },
    {"tag":"work_life_balance",
    "patterns": ["how to achive work-life balance","how to balance work and life","japan work and life"],
    "responses": ["I will give you five tips to help you achieve an equilibrium between life and work should you ever work in Japan.1. Learn to say no 2. Find a healthy hobby 3. Discuss your options 4. Allot a day for unwinding 5. Don't be afraid to seek professional help. Good luck!"],
    "context":[""]
    },
    {"tag":"international_cooperation",
    "patterns": ["japan cooperation","international cooperation","what about japan cooperation","can you give me information about international cooperation"],
    "responses": ["From its earliest days, Japanese international cooperation was aimed at supporting the economic takeoff of partner countries or, in other words, aimed at helping recipient countries to graduate from aid dependence, and ultimately to reach a position of self- sufficiency where economic growth provides the needed domestic resources to sustainpublic and private investment. In the view of the Japanese aid practitioners, this could only be accomplished by laying the foundations: human resources, infrastructure, and institutions. "],
    "context":[""]
    },
    {"tag":"corporation_recommend",
    "patterns": ["sony","nintendo","top companies","top company","top corporations","recommend company","japan corporations","can you give me information top corporation"," top corporation in japan"],
    "responses": ["Here's top 10 corporations in japan you may want to know: 1. Toyota 2. Nippon Telegraph and Telephone 3. Sony 4. Keyence 5. KDDI 6. Mitsubishi UFJ Financial 7. SoftBank 8. Fast Retailing 9. Daiichi Sankyo 10. Nintendo"],
    "context":[""]
    },
    {"tag":"best_goods",
    "patterns": ["special goods in japan","what should i buy in japan","what japan goods should i buy","best good of japan","best goods from japan"],
    "responses": ["OK. I can recommend you some amazing japanese goods as following: Sake, KitKat bars, Hanko: Japanese name stamps, Kimonos , Vending machine toys, Wagashi candies ,Japanese cosmetics ,Sensu folding fans , green tea, Japanese knives"],
    "context":[""]
    },
    {"tag":"scholarship_opportunities",
    "patterns": ["Scholarship Opportunities","schoolarship in japan","japan schoolarship"],
    "responses": ["There are some schoolarship programs you can try if you want to attend intership or study in japan: Young Leaders' Program, Ministry of Education, Culture, Sports, Science and Technology, Japan; Scholarships for Ph.D. in Sustainable Science, JFUNU Ting Hsin Scholarship at Waseda University, Scholarship for International Students, Kochi University, Japan-International Monetary Fund Scholarship and even more"],
    "context":[""]
    },
    {"tag":"aerospace_research",
    "patterns": ["what about aerospace of japan","universe research","aerospace technology","aerospace","japan aerospace"],
    "responses": ["The organisation was also responsible for the development of the Japanese Experiment Module (also known as KIBO), which was launched and added to the International Space Station during Space Shuttle assembly flights in 2007 and 2008 and the HTV to transfer payloads to the station in 2009.Japan also sends several astronauts to work in the ISS and help other international collaborators with space research and technology transfers."],
    "context":[""]
    },
    {"tag":"japan_ai",
    "patterns": ["japan artificial intelligence","robot artificial intelligence","what about AI","AI","AI in Japan"],
    "responses": ["The Nature Index ranks Japan fifth in the world for its overall Share — a fractional count of author affiliations in index publications — but when Share in only AI and robotics research is considered, Japan falls to seventh. South Korea, for example, increased its Share in AI and robotics in the Nature Index by 1,138% between 2015 and 2021, whereas Japan's increase was 397% over the same time frame. Although much of this trend could reflect Japan's sluggish performance in the rapidly growing field of AI, rather than pure robotics, Japanese robotics experts are well aware of these discouraging statistics."],
    "context":[""]
    },
    {"tag":"japan_robot",
    "patterns": ["robots","robotics","japan robot","japan robotics","can you tell me about robotics"],
    "responses": ["Japan is also known for robotics. There are many types of robots that are used in restaurants, hospitals, parks, or in different companies. Robots are used for different purposes, such as in restaurants in Japan. Japanese research companies are researching on advanced AI robots that can mimic the work of humans"],
    "context":[""]
    },
    {"tag":"japan_building",
    "patterns": ["japan building","top building in japan","building in japan","top building","tallest building"],
    "responses": ["Japan has more than 270 high-rise buildings above 150 m (490 ft). all buildings above 50 m (160 ft) must also be as earthquake-proof as possible and adhere to other strict structural standards. The tallest building in Japan is currently the 325.5 m (1,068 ft) tall Azabudai Hills Mori JP Tower, located in Azabudai Hills, Tokyo. When completed in 2027, the 390 m (1,280 ft) Torch Tower will surpass the Azabudai Hills Mori JP Tower and become the new tallest building in Japan."],
    "context":[""]
    },
    {"tag":"famous_street_recommend",
    "patterns": ["famous street in japan","japan famous street","street in japan","can you recommend some street in japan","top street in japan","top street","popular street","popular streets in japan"],
    "responses": ["Tokyo has endless popular streets to discover. Even within a short space the scenery can quickly change, cycling through restaurants, cafes, shops, and parks rich with nature, so it feels like there's always something new to find around every corner. Kichijoji Sun Road, Jingu-dori, Sugamo Jizo-dori, Musashi-Koyama Shopping Street Palm, Chuo-dori, Takeshita-dori, Shinjuku Golden Gai, Omotesando, Sotobori-dori, Meguro River Cherry Blossoms Promenade"],
    "context":[""]
    },
    {"tag":"fishing",
    "patterns": ["can you tell me about fishing in japan","fishing in japan","japan fishing","fishing"],
    "responses": ["After the 1973 energy crisis, deep-sea fishing in Japan declined, with the annual catch in the 1980s averaging 2 million tons.As a whole, Japan's fish catches registered a slower growth in the late 1980s.Japan has more than 2,000 fishing ports, including Nagasaki, in southwest Kyuoshuo; Otaru, Kushiro, and Abashiri in Hokkaido. Major fishing ports on the Pacific coast of Honshuo include, Hachinohe, Kesennuma, and Ishinomaki along the Sanriku coast, as well as Choshi, Yaizu, Shimizu, and Misaki to the east and south of Tokyo.Fishing in Japan started as a necessary means of subsistence, but has evolved into a popular pastime. Today, you can enjoy fly-fishing in the lakes and rivers that run through the country or head to the ocean for deep-sea fishing. Even major cities such as Tokyo and Osaka have found space for urban fishing a reminder of just how influential the activity remains."],
    "context":[""]
    },
    {"tag":"climb_mountain",
    "patterns": ["climb mountain","mountain in japan","what mountain I can climb","japan mountain","mountain in japan","japan mountains"],
    "responses": ["I can recommend you some mountains which have beautiful landscape, mushrooms harvesting or blossom watching will give you best memorable experience if you have chance to try: Mt. Fuji, Mt. Oku-Hotaka, Mt. Tsurugi, Mt. Asahi, Mt. Kaimon,Mt. Chokai. "],
    "context":[""]
    },
    {"tag":"transportation",
    "patterns": ["transportation","transportation in japan","japan transportation","what about transportation"],
    "responses": ["Japan has an efficient public transportation network, especially within metropolitan areas and between the large cities. Japanese public transportation is characterized by its punctuality, its superb service, and the large crowds of people using it. Air transportation also provides you amazing services and memorable experience. Major of citizens in big metropolis usually walking and go to school or work by subway transprotation. Or, you can also rent cars, bicycles or try bus if you want new experiences. "],
    "context":[""]
    },
    {"tag":"walking",
    "patterns": ["walk in japan","walking tour","japan walking","can i walk"],
    "responses": ["At firts, if you are in Tokyo or big cities, you can try walking along some busy streets, enjoy shopping and eating street food, that's fantastic experience. But, if you want some natural walking or hiking, you can try some tours as following: Kumano Kodo Hiking Trail, The Nakasendo Way, Climb Mount Daimonji, Dorogawa Walking Trails."],
    "context":[""]
    },
    {"tag":"dancing",
    "patterns": ["japan dancing","dance in japan","dance","dancing","what about dance","japan dance"],
    "responses": ["Dance has a long history in Japan and encompasses many forms. The dances performed in kabuki plays are called Nihon buyo (Japanese dance) and are widely enjoyed not just by professional actors but by ordinary people, who learn them as a hobby.There are two types of movements in Japanese dance. One comes from mai, which has its roots in noh drama, and the second comes from odori, which originated in kabuki. Moreover, Japan's most popular dance is the bon Odori, performed during Obon, the Buddhist festival is in honour of one's ancestors' spirits. "],
    "context":[""]
    },
    {"tag":"sports",
    "patterns": ["sports in japan","sport","sprots","japan sports","japan sport","what about sports"],
    "responses": ["Many different sports are played in Japan. Traditional martial arts like judo and kendo are popular, as are sports imported from overseas, such as baseball and soccer (football). Many Japanese go to the sea for surfing and scuba diving in the summer, while skiing and snowboarding are popular winter pursuits."],
    "context":[""]
    },
    {"tag":"sport_achievement",
    "patterns": ["japan sport achievement","achievement in sport","sport achievement","sport achievements","what about sport achievement"],
    "responses": ["Japan won its first medals in 1920, and its first gold medals in 1928. Japanese athletes have won 497 medals at the Summer Olympic Games (except art competitions), with the most gold medals won in judo, Skateboarding and Karate,as of the end of 2020 Summer Olympics."],
    "context":[""]
    },
    {"tag":"economy",
    "patterns": ["japan economy","japanese economy","economy in japan","what about economy","economy","economies"],
    "responses": ["The service sector has come to dominate the economy in terms of its overall proportion of the gross domestic product (GDP) and of employment.The emphasis on trade stems from Japan's lack of the natural resources needed to support its industrial economy, notably fossil fuels and most minerals. Generally, however, Japan's strong domestic market has reduced the country's dependence on trade in terms of the proportion trade contributes to the GDP when compared with that of many other countries."],
    "context":[""]
    },
    {"tag":"green_energy",
    "patterns": ["japan green energy","green energy","green power","green energy in japan"],
    "responses": ["In 2021, renewables made up about 22% of total electricity generation, which is two percentage points higher than in 2020. Solar and wind power have become much more prominent thanks to the Renewable Energy Act, which became effective in 2022."],
    "context":[""]
    },
    {"tag":"nuclear_energy",
    "patterns": ["japan nuclear energy","nuclear energy","nuclear","energy in japan"],
    "responses": ["Since 1973, Japan has been looking to become less dependent on imported fuel and start to depend on nuclear energy. In 2008, after the opening of 7 brand new nuclear reactors in Japan (3 on Honshuo, and 1 each on Hokkaido, Kyuoshuo, Shikoku, and Tanegashima) Japan became the third largest nuclear power user in the world with 55 nuclear reactors. These provide 34.5% of Japan's electricity.Following an earthquake, tsunami, and the failure of cooling systems at the Fukushima I Nuclear Power Plant on March 11, 2011, a nuclear emergency was declared. 140,000 residents within 20 km of the plant were evacuated. See Radiation effects from Fukushima Daiichi nuclear disaster 900."],
    "context":[""]
    },
    {"tag":"take_photo",
    "patterns": ["take photo in japan","take photo","take photos","japan taking photo","taking photo","take picture","japan shooting","best photo spots"],
    "responses": ["There are a lot of beautiful landscapes to take pictures in japan for example :Miyajima, Mt. Fuji, Senso-ji Temple, Shibuya, Kiyomizudera & Gion District, Hiroshima Peace Memorial Park, Nara, Noboribetsu,Osaka Castle,Hitachi Seaside Park, Shirakawa, No. 1 Tadami Bridge Viewpoint .But, before you visit Japan, you need to familiarize yourself with a few laws. Read this guide on how to avoid getting in trouble and how to keep your Japan photography respectful: Always Ask for Permission When Practicing Photography in Japan. If You Can't Get Permission to Post a Photo, Blur the Person's Face. Be Prepared to Show Your Photos to the Police. Don't Use Selfie Sticks in Crowded Areas to Avoid Injuries. Photography Etiquette in Cafés and Restaurants. Don't Use Flash If You're Taking Photos at Night"],
    "context":[""]
    },
    {"tag":"driving",
    "patterns": ["driving in japan","japan driving","driving cars","driving motobikes","what about driving","driving license"],
    "responses": ["There are some tips I recommend for you if you want to drive any vehicles in Japan:  Familiarize yourself with the Japanese road signs before you go.In Japan, you will keep the left side of the road, and the steering wheel is on the right side of the car. Speed limits in Japan.Highway access signs are green and rectangular. Entering the highway, you'll collect a ticket from a usually unmanned station to pay and exit. 5.If you rent a vehicle, the chances are that it will come with insurance and a 24/7 emergency number.There are 3 main kinds of gas for vehicles used in Japan: diesel, regular, high octane. No right on red , Come to a complete stop at railroad crossing, Only those with a valid permit and license can drive, Under no circumstances can you drink and drive. Please notice that in Japan, International driver's licenses come in different types depends on license was issued or not by countries affiliated with the 1949 Geneva Convention. Finally, No cell phones while driving."],
    "context":[""]
    },
    {"tag":"camping",
    "patterns": ["camping in japan","japan camp","camp in japan","how can i camp in japan","camping","what about camping","where can i camp","campsite"],
    "responses": ["Camping is a great way to immerse yourself in Japan's natural landscapes.With about 3,000 campsites scattered across the country, you're sure to find a location that suits your needs, though reservations are highly recommended for example:Fujikawaguchiko, Okinawa, Shiga, Saitama, Yamanashi .Whatever your budget, there are campgrounds and campsites to meet your needs.In Japan, campgrounds generally come with amenities, including running water and electricity. There are usually toilets and sinks, and many are near onsens. Some of the larger campgrounds feature activity areas with tennis courts, playgrounds and fishing ponds. Campfires are usually prohibited in Japan, but most locations allow you to bring a fire pit."],
    "context":[""]
    },
    {"tag":"apartments",
    "patterns": ["apartments in japan","japan apartments","rent apartments","how can i rent apartment","japan apartment"],
    "responses": ["Do you know how to find and rent an apartment in Japan. The rental process is time consuming and requires a lot of paperwork, so it can be a bit tricky for foreigners- not to mention the fact that foreigners are required to have a Japanese co-signer called a guarantor. There are some tips to rent apartments or live long time in Japan for you:  1. Decide Your Needs/Preferences 2.Once you've made your choice, the agent will prepare the application for you. 3.Once you find an apartment and you're ready to sign the contract, the initial payment is typically going to be the largest. Of course it all depends on the situation, but you may have to pay an amount equal to five or six times your monthly rent as an initial payment. And Japan is still a cash-based society, so don't forget your cash! Here are the costs you'll have to take care of for your initial payment: Appreciation money , Security deposit, Brokerage fee, Fire insurance , First month's rent, Guarantor company usage fee. After settling that first payment and signing the contract, you will receive the keys to your new home. Get in touch with a moving company and prepare to move in."],
    "context":[""]
    },
    {"tag":"bills",
    "patterns": ["bills in japan","japan bill","how can i pay my bill","bill","bills","invoice in japan","invoice"],
    "responses": ["You have to pay some kind of bills for your living life for example renting fee, electricity, water, internet, shopping invoice, food, tax, gas and even TV fee from NHK,... "],
    "context":[""]
    },
    {"tag":"rent_cars",
    "patterns": ["rent cars in japan","how can i rent cars in japan","renting car","rent car"],
    "responses": ["All major Japanese rental companies (such as Toyota Rent a Car, Nissan Rent a Car, Times Car Rental) have websites in Japanese, English, and Mandarin Chinese (and often other languages). Booking online is recommended.Remember that usually bigger rental companies, while massively more convenient in terms of pick up and drop off locations (as well as availability), can be a little pricier than their smaller counterparts."],
    "context":[""]
    },
    {"tag":"mansion",
    "patterns": ["mansion in japan, japan mansion","what about mansion","can you tell me about japan mansion","mansion","rent mansion"],
    "responses": ["Mansion in Japan is built upwards instead of horizontally. Mansion are generally at least 3-floors high and can go as high as the builder wants.The big Japanese cities have plenty of them that are over 10 floors high, which are called tawa mansion. In japan, apartment is cheaper than tawa mansion or even mansion, as Japanese people generally view living on the lower floors of tawa mansion and even mansion as a little uncool.  If you like quiet, convenience, and don't mind having to pay for the privilege and possibly chip in from time to time, a mansion is good. If, however, you are pretty tolerant of noise and want to live as cheaply as possible, an apartment is a far better choice."],
    "context":[""]
    },
    {"tag":"dormitory",
    "patterns": ["dormitory in japan","japan dormitory","tell me about japan dormitory","dormitory","dorms","japan dorms"],
    "responses": ["Rooms in Japanese dormitories are smaller than what many international students may be used to. So, it may take some time to adjust to. They are, however, designed in a way that makes efficient use of space. So, there's enough room for all your necessary accessories. Japan is one of the many nations that takes recycling seriously and has made it part of its customs. The way garbage is separated often varies by country, so you may get confused by the rules here.Another key thing you may notice in the dorms are rulebooks that show what students are allowed to do and what they cannot.Japanese dorms give students the chance to socialize and interact with their fellow dorm mates as often as they like, as well as give them their own spaces where they can have their own privacy. Don't hesitate to socialize and make the most of your dorm life. Compared to other accommodation options, it's easier to make friends in a dorm. It is always nice to have friends whose door you knock on and say hi to when you need them."],
    "context":[""]
    },
    {"tag":"shopping",
    "patterns": ["shopping in japan","japan shopping","tell me about shopping","what about shopping"],
    "responses": ["Japan is a shopping paradise with a wealth of stores selling everything from traditional souvenirs and local food to the latest electronics and hottest fashion brands. Both domestic and foreign brands are represented, as are stores for all budgets, from the 100 yen shops to high-end fashion boutiques and department stores.Large cities, such as Tokyo and Osaka, sport several shopping districts, each with their own unique character, usually grouped around major train stations. Shops are also found in shopping centers, along covered shopping arcades and in extensive underground malls. Outside of the city centers, large big box retailers, outlet malls and suburban shopping malls compete for shoppers with lots of variety."],
    "context":[""]
    },
    {"tag":"shopping_online",
    "patterns": ["shopping online","japan shopping online","what about shopping online"],
    "responses": ["We all know about the quality of Japanese good, so if you live far from Japan but want  to buy domestic Japanese stuffs, you can buy it online from some best online shops as following: Rakuten.com,Amazon.co.jp, Kakaku.com, Shopping.yahoo.co.jp, DMM.com.  "],
    "context":[""]
    },
    {"tag":"convenience_store",
    "patterns": ["convenience store","convenience store in japan","tell me about convenience store","what about convenience store","convenience"],
    "responses": ["A konbini (convenience store in Japanese) has bento lunches, snacks, desserts, magazines, and an array of services like buying concert tickets or shipping your luggage to the airport. You can practically find a convenience store on every corner in Japan from 7-Eleven, Ministop, Lawson, Family Mart,.."],
    "context":[""]
    },
    {"tag":"vendors",
    "patterns": ["vendors in japan","vendor","street food vendor","japan vendor","vendors","japan vendors"],
    "responses": ["During the summer, during matsuri (festival) season, there is something close: Yatai, open-air stalls or booths selling a wide assortment of easy-to-prepare and eat foods to crowds of festival goers. Essential Japanese Street Foods at Yatai: Takoyaki, Yakisoba, Okonomiyaki, Yakitori and Other Grilled Meats, Vegetables, Candied Fruit,Wata-ame, Choco Bananas, Crepes, Minature cakes, Dango, Amezaiku, Kakigori (shaved ice with fruit flavors),Yaki-imo(sweet potato), Hot Sake."],
    "context":[""]
    },
    {"tag":"supermarket",
    "patterns": ["supermarket in japan","japan supermarket","tell me about supermarket","what about supermarket"],
    "responses": ["There are several different supermarket chains across Japan as following: Maruetsu, Izumiya, Seiyu, Daiei, Ito-Yokado, AEON, Tobu Store, Inageya.There are certain elements of supermarkets that almost seem universal, and others that are unique to different countries. Some things you can expect at Japanese supermarkets include: Plenty of incredible ready-made meals, No massive shopping carts, Rewards programs are common, An overabundance of plastic packaging. You'll also find several international supermarket chains in Japan for example: Kaldi Coffee Farm, Seijo Ishii, Jupiter Import Foods, Kinokuniya (Tokyo), National Azabu (Tokyo), Costco. I hope you'll have nice travels in Japan! "],
    "context":[""]
    },
    {"tag":"youtuber_recommend",
    "patterns": ["japan youtuber","recommend youtuber","youtuber recommend","japanese youtuber","give me some famous youtubers","youtubers"],
    "responses": ["If you want to get a general overview of what the YouTuber scene looks like, then this list is for you. 10. Rino Sashihara(Beauty, skincare, lifestyle), 9. Entrepreneur Hiroyuki (Self-help, personal development, finance), 8. Naru Fitness (Health, fitness), 7. Motimaru's Diary (Cats, pet care), 6. Banbanzai (Entertainment, music), 5. Heisei Flamingo (Vlog, lifestyle, reviews) , 4. Ryuji ( Cooking, recipes), 3. Janino Channel (Vlog, entertainment, lifestyle), 2. Comdot ( Vlog, travel), 1.Hikakin TV ( Entertainment, reviews, vlog) "],
    "context":[""]
    },
    {"tag":"streamer_recommend",
    "patterns": ["japan streamer","streamer","live stream","streamers","japanese streamer","what about streamer","recommend streamer"],
    "responses": ["According to twitchtracker.com as of the first quarter of 2023, there are some top streamers as following: FPS_SHAKA, STYLISHNOOB4, VALORANT_JPN, K4SEN, JASPER7SE, SPYGEA, SASATIKK,RIOTGAMESJP. Sorry, there are some few other top channels named by Japanese but I can't recommend you here."],
    "context":[""]
    },
    {"tag":"clothes",
    "patterns": ["what about clothes","clothes","japan clothes","japanese clothes","can you tell me about japanese clothes"],
    "responses": ["Sure. Traditionally, Japanese people wear a one-piece garment called kimono which emerged during the Heian Period (794-1185). Kimono is made out of silk and each motif has a meaning. Cranes represent longevity; pine-trees represent the new year; the Chrysanthemum flower represents the imperial family. The summer kimono is called yukata and the wedding kimono is called uchikake. Kimonos usually have long sleeves for wind to pass through and cool down the body. While children wear kimono with bright colors and flower designs, the elderly wear simple kimonos with simple motifs. Nowadays, Japanese people wear Western clothes at work and school but prefer kimono for social occasions and ceremonies."],
    "context":[""]
    },
    {"tag":"student_living_life",
    "patterns": ["japan student life","student's life","life of student","life of students","life of japanese student"],
    "responses": ["Japanese high school students do not drive cars. Many either walk or ride bicycles if the distance is not too great. In other cases, students must take public buses and trains, often changing lines several times in order to reach their destinations. After junior high school, students attend schools based on standardized high school entrance examination scores.  The school day begins at 8:30, once at school, the students usually enter an area full of small lockers in which they place their street shoes and don school slippers.Japanese students spend 240 days a year at school, 60 days, many of those days are spent preparing for annual school festivals and events such as Culture Day, Sports Day, and school excursions. At the end of the academic day, all students participate in o soji, the cleaning of the school. Club activities take place after school every day. Teachers are assigned as sponsors, but often the students themselves determine the club's daily activities. Students can join only one club, and they rarely change clubs from year to year. "],
    "context":[""]
    },
    {"tag":"student_relationship",
    "patterns": ["student relationship","japan student relationship","relationship between student","japanese student relationship"],
    "responses": ["As many other Asia countries, Japanese students have some relationships included friendship at school, teacher-students relationship and best friend or friends in clubs.If they're closed enough or their home are near by each other, they will go to school or go home from school together. Some friend group will go shopping or eating snacks or cakes or go to game centers after school if they don't attend in any club. In contrast, students who attend in club will go their club room after classes finished, usually at 4.30 p.m and enjoy their teenage with club activities such as playing sports, researching or just enjoying games, manga or anime together. There are few students have love relationship or just unrequited love with girl/boy friends at school. While opposite sexes are interested in each other, parents and teachers strongly discourage teenage dating. Even more, there are some cases of love relationship between teachers and studens which strongly opposed by society,schools and student's families. "],
    "context":[""]
    },
    {"tag":"accessories",
    "patterns": ["japan accesory","japanese accesories","accessories","accessory","top accessory","best accessories"],
    "responses": ["Japan is chock-full of inimitable and wacky products ranging from the fun but not-so-practical novelty trinkets to the inventive and useful solutions for everyday living. If you're on the hunt for life-changing kitchen appliances and beautiful yet functional homeware, you've come to the right place. Corny keychains and snow globes these are not - here are some products that make great Japanese souvenirs as following: Ghibli Mini Humidifier, King Salmon Dismantling Puzzle, POJ Studio Kintsugi Kit, Michi-Kusa Vase, Hibi incense, Frixion erasable pens. "],
    "context":[""]
    },
    {"tag":"holidays_celebrations",
    "patterns": ["what about holidays","special events","japan holiday","japan holiday","japanese holiday","japan special events","celebration","japan celebrations","japanese celebrations","what about celebrations"],
    "responses": ["If you look at the Japanese calendar, you would notice that there is a major cultural celebration almost every month. Japanese people like celebrating seasonal changes to show their appreciation of new beginnings. The three most important celebrations in Japan are: 1) The new year's day. Japanese people visit a shrine after the midnight on Dec 31 to make a wish. 2) Cherry blossom celebrations in April. It is a custom to have a picnic under the cherry trees. 3) The Obon Holiday in August. Japanese people visit their hometown to commemorate the spirits of those who passed away."],
    "context":[""]
    },
    {"tag":"dating",
    "patterns": ["group dating","dating in japan","japan dating","japanese dating","tell me about dating in japan"],
    "responses": ["Going on a date with a Japanese person is usually a more extended experience than in some Western cultures. Instead of spending a few pleasant hours together over drinks or simply going to dinner, a Japanese date traditionally entails a more significant time commitment. A Japanese date can last from a half to a full day or even include a small getaway when schedules and budgets allow. These extended dates can be filled with various engaging activities, like shopping, or visiting a theme park or aquarium, in addition to patronizing restaurants or cafes for meals and drinks. Especially on weekends, Japanese dates are normally much longer affairs than in some countries.Longer, adventurous dates can be helpful for Japanese couples toward the beginning of a relationship, as taking part in each activity can help break the ice. This is especially useful when daters are naturally shy, which tends to be common in Japan. Restaurants or cafes are often involved at some point during dates in Japan. Other favored dating activities include hikes, picnics, drives, beaches, day trips, parks or zoos, the cinema, and even staying home. Knowing how much to spend can be tricky in any dating culture, but according to surveys, 3,000-5,000 yen is an appropriate budget for an average date."],
    "context":[""]
    },
    {"tag":"population",
    "patterns": ["japan population","population in japan","japanese population","population","tell me about japan population","what about population"],
    "responses": ["According to worldometers.info: The current population of Japan is 125,416,355 as of Sunday, April 2, 2023, based on Worldometer elaboration of the latest United Nations data.Japan population is equivalent to 1.62% of the total world population. Japan ranks number 11 in the list of countries (and dependencies) by population.The population density in Japan is 347 per Km2 (899 people per mi2). 91.8 % of the population is urban (116,099,672 people in 2020).The median age in Japan is 48.4 years."],
    "context":[""]
    },
    {"tag":"wedding",
    "patterns": ["japan wedding","wedding in japan","japanese wedding","wedding","tell me about wedding","what about wedding"],
    "responses": ["A Japanese wedding ceremony may be Shinto, Christian, Buddhist, or non-religious. Couples choose the style of their wedding ceremony, which might be different from the style that's typical of their own religion. Today, the traditional Japanese ceremony is Shinto-style, performed by a Shinto priest and held at a shrine.The ceremony itself is very formal and usually very private, with only close family and a few guests present.Japanese Wedding Rituals include : Palace Visit ... Admission to the private ceremony of the bride and groom. The exorcism of a person or place of evil spirits.Food Offerings to God .The recital of Shinto prayers, for happiness in the future and to thank God. Three-Times-Three ... San San Ku Do, the exchange of nuptial cups, following the wedding vows.The offering of a branch of the sacred tree, the Sakaki, symbolized by a zigzag-shaped paper streamer used to adorn Shinto-related objects.Thid tradition of changing clothes several times dates from the 14th century and symbolizes the bride's readiness to return to everyday life. At a Shinto reception, the bride will get married in a long white kimono. If she has a Western-style wedding, she might arrive in a wedding dress, then change into a kimono and then into one or more party dresses.   "],
    "context":[""]
    },
    {"tag":"funeral",
    "patterns": ["japan funeral","funeral in japan","japanese funeral","funeral","tell me about funeral","what about funeral"],
    "responses": ["Funerals are always a difficult time. Unfortunately, such occurrences are an inevitable part of life in Japan just like everywhere else. There are 2 sessions of a fureral in Japan you should know: Otsuya - Wake Ceremony and Ososhiki (Kokubetsushiki) - Funeral Ceremony. For Otsuya, attendees do not have to wear mourning clothes. The opening of the Otsuya is usually in the evening, and people may arrive after work, so there is no problem with plain clothes. However, avoid flashy clothes and, if possible, wear subdued colors such as black or grey. Japanese mourning clothes (kimonos) are worn by the widow or other relatives close to the deceased and should not be worn by attendees. For Japanese Funeral (Ososhiki), Black is the color of mourning in Japan. While in the recent years dark blue and dark gray is becoming more acceptable, black is still preferred over all other colors. It can't be stressed enough that you must never attend a Japanese funeral without the appropriate attire—to do so would be the ultimate sign of disrespect.You should bring Okoden- a money offering, in this case condolence money, which is typically given to the bereaved by guests at Japanese funerals. The amount will generally be from 3,000yen to 30,000yen, depending on the relationship to the deceased."],
    "context":[""]
    },
    {"tag":"new_year_traditions",
    "patterns": ["new year tradition in japan","new year culture","japan new year tradition","new year tradition","tell me about new year in japan"],
    "responses": ["New Year events in Japan is January first as Western New Year. In Japanese culture, the new year must begin on a clean slate. As a result, Japanese people usually partake in something called oosouji, or big cleaning. A lot of times, every inch of the household is cleaned, including places that remain untouched other times of the year.Another big tradition in Japanese culture is eating certain foods, Toshikoshi soba is eaten on the eve of New Years, while ozoni and osechi are enjoyed the actual day of.On New Year's, there is a tradition of handing a bit of money in an envelope to the children called Otoshidama. It usually isn't much, but it is something many kids in Japan look foward to."],
    "context":[""]
    },
    {"tag":"love",
    "patterns": ["love in japan","japan love","japanese love","what about loves","tell me about love in japan"],
    "responses": ["It's a big deal to say I love you in Japan, and Japanese people, by and large, tend to express their love verbally only on rare occasions, choosing instead to show their love through actions and gestures. "],
    "context":[""]
    },
    {"tag":"japan_problems",
    "patterns": ["population aging","lack of human resources","problem of japan","japan problem","problems","japan issue"],
    "responses": ["Although Japan has great conditions of economy, facilities and high technology, this country also has to face a lot of challange nowadys, there are some problems as following: This community's quarter century without a newborn shows the scale of Japan's population crisis. Supply chain issues, rising labor costs, and political issues have highlighted problems with Japan's reliance on China as a base for its manufacturing investments. With a low birthrate and aging population, Japan's social security system is under strain and is suffering from labor shortages."],
    "context":[""]
    },
    {"tag":"television",
    "patterns": ["TV in japan","TV news","japanese television","television in japan"],
    "responses": ["In Japan, there are seven national television networks – two owned by the national public broadcaster NHK, and five national commercial key stations. Although some of the network names shown below are used only for news programming, the applicable organizations also distribute a variety of other programs over most of the same stations such as : NHK , Nippon TV, tvk, TV Asahi, TBS, TV Tokyo, Fuji TV, Tokyo MX. "],
    "context":[""]
    },
    {"tag":"newspaper",
    "patterns": ["newspaper in japan","japan newspaper","japanese newspaper","what about newspaper","tell me about newspaper"],
    "responses": ["Major papers: Yomiuri Shinbun, Asahi Shinbun, Mainichi Shimbun, Nikkei Shimbun. With Regional papers, we have Sankei Shimbun, Chunichi Shimbun/Tokyo Shimbun,  Nishinippon Shimbun, Hokkaido Shimbu, Chugoku Shimbun. For Specialty papers, Among niche newspapers are publications like the widely circulated Nikkan Kogyo Shimbun, Seikyo Shimbun from Buddhist organization, Shimbun Akahata. "],
    "context":[""]
    },
    {"tag":"climate",
    "patterns": ["japan climate","japanese climate","climate in japan","tell me about climate"],
    "responses": ["In gereral, Eastern Japan has hot and humid summers and cold winters with very heavy snow on the Sea of Japan side and in mountainous areas. Western Japan has very hot and humid summers (with temperatures sometimes reaching 35 oC or above) and moderate cold winters. Okinawa and Amami have a subtropical oceanic climate."],
    "context":[""]
    },
    {"tag":"mysteries",
    "patterns": ["mysterious things in japan","japan mistery","japanese mistery","mysterious story","mysterious stories","mysteries"],
    "responses": ["Sure, I can give you names of 7 unsolved mysteries in Japan: 1. The Wednesday Strangler, 2. North Kanto Young Girl Serial Kidnapping and Murder Case, 3. The Vending Machine Killer, 4. The Satanic Verses Murder, 5. Inokashira Park Dismemberment , 6. The Hachioji Supermarket Triple Murder , 7. Myojo 56 Building Fire. "],
    "context":[""]
    },
    {"tag":"romantic_shows",
    "patterns": ["romance in japan","romantic","romantic stories","romantic","romantic story","tell me some romantic shows","romance","japan romance","romance show","romance shows"],
    "responses": ["The most common and popular dating romance shows in Japan are Love Is Blind: Japan . Love Is Blind: Japan is a Japanese reality dating streaming television series which premiered on Netflix on February 8, 2022. The show is hosted by Takashi Fujii and Yuka Itaya. Following the format of Love Is Blind, a group of men and women tried to find future partners for marriage. The original language is in Japanese and features 11 episodes."],
    "context":[""]
    },
    {"tag":"comedy_show",
    "patterns": ["comedy shows","japan comedy","tell me about comedy show","comedy show","comedy show in japan","what about comedy show"],
    "responses": ["Japanese comedy can be… strange.There's not much else like it and Western comedy really can't match the ironic surrealism of Japan's token comedy styles. To really grasp the humor used in some of these awesome Japanese TV comedies, it's helpful to understand different types of Japanese comedy such as  Kyogen,  Rakugo, Manzai, Konto, Owarai, Nininbaori. Here's a list of some japanese comedy shows you may like: Why Did You Come to Japan?, Mecha-Mecha Cool!, Spooky Romantics, Tokyo Tarareba Girls, Showdown! Takeshi's Castle, Mystery-solving Variety Adventure to the Edge of the World, My Boss, My Hero , Overprotected Kahoko, Operation Love, Punch Line. "],
    "context":[""]
    },
    {"tag":"weather",
    "patterns": ["what is the weather today","can you show me weather","weather today","weather"],
    "responses": ["If you want to ask about weather generally, please talk to me by key word climate. If you want to ask specific realtime weather, I am just a closed chatbot and have not yet connected with the internet, so please contact to my friends Cortana or Google Assistant for more details. I'm sorry for my uselessness."],
    "context":[""]
    },
    {"tag":"subway",
    "patterns": ["subway in japan","subway","japan subway","japanese subway","tell me about subway in japan","what about subway"],
    "responses": ["Ticket machines, station names, as well as maps and guides of the subway and the local area are often provided in a number of languages. In the larger cities such as Tokyo and Osaka , there are often subway stations clustered in similar areas. If you are unsure about the price of a ticket, simply purchase the cheapest one and adjust the fare when you exit at your destination—there are fare adjustment machines next to the ticket gates. For ease of travel and peace of mind, research the subway system in the area you will be traveling in. In addition, Subway and other chain fast-food places generally serve different cuisine in other countries. Here are some Subway items you can only get in Japan! Shrimp Avocado Sandwich, Cream Soda Float, The Sweet Sub, Shrimp & Red Snow Crab, Smoked Ham And Mascarpone, Zeitaku Ebi Sand, Infinite Destroyer, Meatloaf Sub, Hot Dog Barbecue Sub, Subway Taco, Grilled Eel or Grilled Beef Tongue Don(Rice). Hope that satisfy you!"],
    "context":[""]
    },
    {"tag":"air_transport",
    "patterns": ["I want some information about flight to japan","flight to japan","flight in domestic japan","air transport","air plane","japan air transport"],
    "responses": ["Before World War II, air transportation in Japan was considerably restricted, but, since the foundation of Japan Airlines (JAL), commercial air travel to both domestic and international destinations has become commonplace and widespread. The growth in air travel has severely strained the country's airport capacity, despite the addition of new airports on artificial islands near osaka (1994), Nagoya (2005) and Kobe (2006) and expansion at existing facilities in Tokyo and osaka."],
    "context":[""]
    },
    {"tag":"renting_vehicles",
    "patterns": ["renting bicycle","renting motorbike","motorbikes","rent bicycle","I want to rent bicycle"],
    "responses": ["For people who love to drive or ride, the roads around Japan's tallest peak are incredible. Don't Forget Your International Driving Permit if you want to ride a motorbike. Best Places to Rent a Motorcycle: Japan Bike Rentals is a good place to start when you're looking to rent a motorcycle in Japan, moreover, you should rent an ETC Card for Tolls.For those love riding bicycle, at first don't forget Rules for safe cycling, there are some Benefits of renting a bike: Flexibility and freedom, Affordable and eco-friendly. Where can you rent bikes: Tourist centers, City bike options, At your accommodation or Independent bicycle shops.Many rental bike providers will have different models to choose from, and a common consideration is whether to opt for a powered or unpowered set of wheels. "],
    "context":[""]
    },
    {"tag":"renting_lover",
    "patterns": ["renting girlfriend","renting girls","rent girl","how can i rent a girl friend","renting girl in japan","is it legal to rent girlfriend in japan"],
    "responses": ["Yes, you can officially Rent A Girlfriend in Japan.There are some mobile apps or websites for you, the most common website is Puchikano, a Japanese website where you can rent your very own girlfriend for a day and take her on a date just like in the anime. The average price for renting a girlfriend is 13,000 to 15,000 yen (~$120-140) for just 2 hours, but it doesn't stop there. There is a 1,000 yen nomination fee and an additional 3,000 yen for a yukata, swimsuit, or even a cosplay date, and you still have to pay for her travel expenses. Speaking of traveling, this rental service only applies to people near or in Osaka, Kobe, and Kyoto."],
    "context":[""]
    },
    {"tag":"flowers",
    "patterns": ["flowers in japan","best flower in japan","japan flower","japanese flower","flower","flowers","what about flowers"],
    "responses": ["There are some most Popular types of flowers as following: Plum blossoms (ume), Cherry blossoms (sakura)- late March to mid April in Tokyo, Tulips- late April to early May in Tonami, Toyama, Pink moss (shibazakura) - mid April to mid May in Fujigoko, Roses (bara)- May and October in Tokyo, Wisteria (fuji) -  late April to early May in Tokyo, Hydrangea (ajisai)- mid June to mid July in Kamakura and Hakone, Irises (hanashobu) - June in Tokyo, Sunflowers (himawari) - early July to early August in Hokkaido, Lavender - mid July to early August in Hokkaido, Autumn Colors (koyo) - typically mid September to early December across Japan. Hope you enjoy this."],
    "context":[""]
    },
    {"tag":"pets",
    "patterns": ["japan pets","pets in japan","pet","pets","japanese pets","tell me about most popular pets in japan","what about pets","cat","dog","cats","dogs"],
    "responses": ["Over the last few decades, pet ownership in Japan has gradually moved from a predominantly utilitarian function to a concept that more fully incorporates pets into the family system. In many cases, pets are now considered to be family members. To many Japanese, pets are as well loved as children, and may even serve as a substitute for those who choose to forgo child-rearing.Dogs and cats are the most popular pets in Tokyo. However, due to many landlords restricting dog and cat ownership, smaller pets are also popular including fish, turtles, hamsters and ferrets. Certain animals are categorised as special animals and require permission to own in Japan."],
    "context":[""]
    },
    {"tag":"animals",
    "patterns": ["animals in japan","japan animals","japanese animals","animal in japan","animal","animals","tell me about animal"],
    "responses": ["Here's a list 20 Of The Coolest Animals In Japan:Pikas, Red Crowned Cranes, Leopard Cats, Sables, Sika Deers, Red Foxes, Ryukyu Flying Fox, apanese Fireflies, Red Pandas, Dugongs, Japanese Serows, Giant Spider Crabs, Bears, Goblin Sharks, Dwarf Flying Squirrels, Asian Giant Hornets, Japanese Giant Salamanders, Tanuki (Raccoon Dogs), Martens and finally Macaque Monkeys (snow monkeys). "],
    "context":[""]
    },
    {"tag":"attracting_destination",
    "patterns": ["attract destinations in japan","attracting destination","attracted destination","attraction","japan attraction","attractions","attraction in japan"],
    "responses": ["Steeped in history, Japan has a rich culture that everyone should experience at least once in their lifetime. With its stunning landscapes and impressive city skylines, there is so much to see and do. To help you make the most of your time and experience the very best Japan has to offer, I will list some most popular attractions in japan you should never miss: Mount Fuji, Animal Islands, Naoshima (Art Island), Osaka Castle, igokudani Yahen-Koen, Okinawa Churami Aquarium, Hiroshima Peace Memorial Park, Tokyo Imperial Palace, Tsukiji Jogai Shijo, Fushimi Inari-taisha, Dotonbori, Chuobu-Sangaku National Park and the Japanese Alps, Hakone Open-Air Museum, Koyasan Okunoin, Naoshima and Teshima,  Matsumoto Castle, Kinkaku-ji, Temple of the Golden Pavillion, Kenroku-en Garden, Itsukushima Shrine, Shinjuku Gyoen National Garden,    "],
    "context":[""]
    },
    {"tag":"cars_parking",
    "patterns": ["cars parking","parking","parking in japan","how can i park my cars in japan","how should i park vehicles"],
    "responses": ["Parking in Japan is not too hard (except for some areas in the major cities). White lines marking a parking spot mean that you can park your vehicle for free. In other cases, you'll need to pay a certain amount for a set period of time. The cost changes massively depending on the city and the area within the city.Some parking lots operate with moving platforms that send your cars in a beehive-type of arrangement. These parking lots have restrictions when it comes to the size of cars they accept. Generally, even small SUVs cannot be parked there."],
    "context":[""]
    },
    {"tag":"forests",
    "patterns": ["what mysterious about forest in japan","forest in japan","can you tell me about forest in japan","japan forest","forest"],
    "responses": ["They are mainly planted after the Pacific War, in attempt to produce construction material, but after Japan had experienced rapid economic growth, they switched construction material from wood to reinforced concrete.","Aokigahara ('Blue Tree Meadow'), also known as the Sea of Trees (Jukai), is a forest on the northwestern flank of Mount Fuji on the island of Honshu in Japan, thriving on 30 square kilometres (12 sq mi) of hardened lava laid down by the last major eruption of Mount Fuji in 864 CE. The western edge of Aokigahara, where there are several caves that fill with ice in winter, is a popular destination for tourists and school trips. Parts of Aokigahara are very dense, and the porous lava rock absorbs sound, contributing to a sense of solitude that some visitors attribute to the forest.The forest has a historical reputation as a home to yuorei: ghosts of the dead in Japanese mythology. At least since the 1960s, Aokigahara has become associated with suicide, eventually becoming known in English by the nickname Suicide Forest and gaining a reputation as one of the world's most-used suicide sites. Because of this, signs at the head of some trails urge suicidal visitors to think of their families and contact a suicide prevention association."],
    "context":[""]
    },
    {"tag":"rivers",
    "patterns": ["japan rivers","river","rivers","river in japan","tell me about japan river","rivers in japan"],
    "responses": ["Rivers of Japan are characterized by their relatively short lengths and considerably steep gradients due to the narrow and mountainous topography of the country. An often-cited quote is 'this is not a river, but a waterfall' by the Dutch engineer (o-yatoi gaikokujin) Johannis de Rijke who had visited the Joganji River, Toyama Prefecture. The Mogami, the Fuji and the Kuma are regarded as the three most rapid rivers of Japan. Typical rivers of Japan rise from mountainous forests and cut out deep V-shaped valleys in their upper reaches, and form alluvial plains in their lower reaches which enable the Japanese to cultivate rice fields and to set up cities. Most rivers are dammed to supply both water and electricity. The longest river of Japan is the Shinano, which flows from Nagano to Niigata. The Tone has the largest watershed and serves water to more than 30 million inhabitants of Tokyo metropolitan area."],
    "context":[""]
    },
    {"tag":"yakuza",
    "patterns": ["what is yakuza","loan shark","yakuza","japanese thugs","tell me about yakuza","japan thugs","thug","yakuza in japan"],
    "responses": ["The English equivalent for the term yakuza is gangster, meaning an individual involved in a Mafia-like criminal organization The yakuza are known for their strict codes of conduct, their organized fiefdom nature and several unconventional ritual practices such as yubitsume or amputation of the left little finger. The yakuza still regularly engage in an array of criminal activities and many Japanese citizens still remain fearful of the threat these individuals pose to their safety.[9] There remains no strict prohibition on yakuza membership in Japan today, although many pieces of legislation has been passed by the Japanese government aimed at impeding revenue and increasing liability for criminal activities."],
    "context":[""]
    },
    {"tag":"fruits",
    "patterns": ["why japanese people don't like eating fruits they plant themselves","fruit","fruits","fruit trees","japan fruits","japan fruit","fruit in japan","fruit picking","tell me about fruit picking in japan"],
    "responses": ["The most common way to encounter fruits in Japan is as dessert at the end of a meal. Fruit picking is a popular tourist attractions.The stereotype is wrong in that regular fruits in regular supermarkets are generally reasonably priced like elsewhere in the world. Nonetheless, there is a sizeable market for luxury fruits, and many foreign visitors are surprised when they see premium melons in department stores that cost over 10,000 yen. Here's a list of some of the most popular Japanese fruits: Nashi (Japanese Pear), Ringo (Apple), Kaki (Japanese Persimmon), Mikan (Mandarin Orange), Yuzu (lemon), Sudachi (lemonade), Kinkan (Kumquat), Momo (Peach), Sakuranbo (Cherry), Ume (Japanese Plum), Ichigo (Strawberry), Budo (Grape), Melon, Suika (Watermelon), Kiwi, Ichijiku (Fig). "],
    "context":[""]
    },
    {"tag":"rice",
    "patterns": ["what can make from rice","does japanese people like eating rice","rice in japan","japan rice","tell me about rice","japan rice"],
    "responses": ["Rice (kome) is Japan's most important crop, and has been cultivated across the country for over 2000 years. It is the primary staple food of the Japanese diet and of such fundamental importance to the Japanese culture that it was once used as currency, and the word for cooked rice (gohan) has become synonymous with the general meaning of meal. There are some types of rice you can find: White rice (hakumai), Brown rice (genmai), Multigrain rice, Glutinous rice (mochigome).Some common Rice products: Rice wine (nihonshu or sake), Rice vinegar, Rice flour, Rice bran (nuka). Common rice dishes: Cooked rice (gohan), Rice cakes (mochi), Rice balls (onigiri), Tamago-kake gohan, Chazuke, Kayu, Donburi, Sushi, Fried rice (chahan), Omuraisu, Rice crackers (senbei), Sweets, Rice bran pickles (nukazuke), Rice bread (komepan)."],
    "context":[""]
    },
    {"tag":"garbage",
    "patterns": ["where should I throw trashs in japan","garbaging sorting","how can i sort garbage","why i have to sort garbage","garbage throwing fees","trash","throw trash","trashes","garbages"],
    "responses": ["While particular garbage separation rules are implemented by each municipality, garbage is divided into four main categories in Japan: burnable, non-burnable, recyclable, and oversized. Most household garbage, including kitchen waste and paper scraps, is classified as burnable garbage.Non-burnable garbage refers to non-recyclable waste, like metal and glass items. A frying pan or glass cup would fall into this category.Plastic bottles, container jars, and cans are classified as recyclable garbage.Lastly, oversized garbage includes large furniture and home appliances. According to the Home Appliance Recycling Law, air conditioners, TVs, refrigerators, and washing machines are not collected in local municipalities.Residents must pay a recycling fee of between 1,000 and 6,000 yen to dispose of their oversized garbage. You can have it collected by shop staff where the item was purchased, or take the item to a designated pick-up location yourself.When disposing of burnable waste, make sure you use a proper garbage bag.These are available at 100-yen shops and supermarkets. It's also possible to reuse a supermarket shopping bag.There are two ways for disposing of garbage in Japan: a collection spot and door-to-door collection.Garbage must be disposed of on the day specified by the municipality in which you live. Many municipalities ask residents to put their garbage out by 8:00 on the pickup date.Hope this summary guide can help you!"],
    "context":[""]
    },
    {"tag":"housing",
    "patterns": ["japan housing","housing in japan","japanese housing","what about housing","can you tell me about housing"],
    "responses": ["To cope with the initial postwar housing shortage, a semigovernmental agency, the Housing Loan Corporation, was established in 1950 to finance house construction at low interest rates. In addition, the area of living space per person and number of rooms per dwelling has gradually increased.Despite the increases in Japan's overall housing stock, housing shortages persist in large metropolitan areas."],
    "context":[""]
    },
    {"tag":"neighborhood",
    "patterns": ["neighborhood in japan","i want to know about neighborhood","japan neighborhood","neighborhood","japanese neighborhood","what about neighborhood","tell me about neighborhood"],
    "responses": ["I can tell you something as following: The neighborhood is the next group to which children in Japan are introduced beyond the family. Although the loose, informal groups of children who wandered through villages of the past have no counterpart in contemporary heavily trafficked city streets, neighborhood playgrounds and the grounds of local shrines and temples are sites where young children, accompanied by mothers, begin to learn to get along with others. Among neighbors, there is great concern for face. More positively, neighbors become uchi for certain purposes, such as local merchants providing personal services, physicians responding to calls for minor ailments and emergency treatment, and neighbors taking care of children while their mother goes out.People who work in the neighborhood where they live often have a different attitude from those who spend most of their waking hours at distant workplaces, creating differences in character between the central city and the suburbs."],
    "context":[""]
    },
    {"tag":"entertainment_park",
    "patterns": ["entertainment park","entertainmain in japan","entertainment park in japan","japan entertainment park","tell me about entertainment park"],
    "responses": ["Japan has a few dozen popular theme parks and amusement parks, including some world-renowned brand names like Disneyland and Universal Studios. There are also a few parks unique to Japan, for example, Nikko Edomura, which is themed in a fun way after a town of the samurai era. During the extravagant years of the bubble economy, many parks were built across Japan, several of which were forced to close again when the economy took a downturn. Those that remain in operation are the bigger and better received ones, usually with unique characters of their own. Here is a list of some of the best theme parks and amusement parks in Japan: Tokyo Disneyland, Fuji-Q Highland, Tokyo DisneySea, Huis Ten Bosch, Universal Studios Japan, Edo Wonderland Nikko Edomura, Tokyo Joypolis, Toei Kyoto Studio Park and lastly, Sanrio Puroland. I hope you enjoy this!"],
    "context":[""]
    },
    {"tag":"water_source",
    "patterns": ["water source in japan","japan water source","water in japan","what about water source","water source","japan water"],
    "responses": ["Access to an improved water source is universal in Japan. 97% of the population receives piped water supply from public utilities and 3% receive water from their own wells or unregulated small systems, mainly in rural areas. Access to improved sanitation is also universal, either through sewers or on-site sanitation."],
    "context":[""]
    },
    {"tag":"electronics",
    "patterns": ["electronics","japan electronics","electronics of japan","can you tell me about electronics"],
    "responses": ["Japan is well known for its electronics industry throughout the world, and Japanese electronic products account for a large share in the world market, compared to a majority of other countries."],
    "context":[""]
    },
    {"tag":"bicycle",
    "patterns": ["bicycle in japan","japan bicycle","bicycle","tell me about bicycle","rent bicycle","what about bicycle"],
    "responses": ["For those love riding bicycle, at first don't forget Rules for safe cycling, there are some Benefits of renting a bike: Flexibility and freedom, Affordable and eco-friendly. Where can you rent bikes: Tourist centers, City bike options, At your accommodation or Independent bicycle shops.Many rental bike providers will have different models to choose from, and a common consideration is whether to opt for a powered or unpowered set of wheels."],
    "context":[""]
    },
    {"tag":"railways",
    "patterns": ["tarin in japan","railways in japan","railway","japan railway"],
    "responses": ["This original Shinkansen line subsequently was extended by lines westward to Fukuoka on Kyushu and northward to Hachinohe in far northern Honshu; In addition, the JR Group has conducted extensive research and development on high-speed train operations utilizing magnetic levitation and propulsion.There are dozens of other private railway companies operating outside the JR Group."],
    "context":[""]
    },
    {"tag":"rice_field",
    "patterns": ["rice field","rice fields","japan rice fields","japanese rice fields","rice field in japan"],
    "responses": ["You’ll regularly see the words tanada and senmaida used to describe rice fields. Tanada refers to terraced paddies while Senmaida means a thousand terraced paddies. Rice planting is always done in Spring or early Summer and harvesting takes place in Autumn. Japanese rice is a round grain variety and exists in two general and distinct forms -koshihikari and sasanishiki - which are grown and cultivated in different parts of Japan. The variety with longer grains is used for sushi. There are more than 100 kinds of rice in Japan and we'll cover a few of the best known types further below, but first, let's take a look at some of the country's most beautiful and historic rice paddies and terraces. Here's a list of Japan's Most Beautiful Rice Fields: Shiroyone Senmaida, Hoshitoge Rice Terraces, Hamanoura Senmaida, Oyama Senmaida, Maruyama Senmaida."],
    "context":[""]
    },
    {"tag":"rich_people",
    "patterns": ["rich people","japan rich people","rich people in japan","tell me about rich people","rich kids","wealthy people"],
    "responses": ["Nomura Research Institute (NRI) announced that wealthy population in Japan is estimated at 1.49 million households in 2021, who hold financial assets of 364 trillion JPY in total. Wealthy households with financial assets of 100 million to 500 million JPY are 1.4 million, and super-wealthy households with 500 million JPY or more are 90,000. The total number is more than the previous record of 1.33 million households in 2019, and wealthy households have increased since 2013, when so-called Abenomics, the economy policy by Abe Administration, started. The total amount of financial assets in 2021 is up 9.3% compared to 2019, and in the same way as wealthy household, it has constantly increased since 2013. NRI analyzes that rise in asset prices, such as stocks, has helped wealthy people increase financial assets, which has driven up the number of wealthy households. "],
    "context":[""]
    },
    {"tag":"poor_people",
    "patterns": ["poor people","poor people in japan","japan poor people","poor","homeless","poorness","poorness in japan","tell me about poor people","poverty","poverty in japan"],
    "responses": ["In Japan, relative poverty is defined as a state at which the income of a household is at or below half of the median household income. According to OECD figures, the mean household net-adjusted disposable income for Japan is US$23,458, higher than the OECD member state average of US$22,387. Unlike several other modern countries, Japan has no official poverty line, making it difficult to get accurate figures on those suffering impoverished conditions. In October 2009, Japan's Labor Ministry released a report which stated that almost one in six Japanese, which would be 22 million people, lived in poverty."],
    "context":[""]
    },
    {"tag":"price_of_goods",
    "patterns": ["prices of goods","prices","japan prices","prices","tell me about prices"],
    "responses": ["The estimated monthly living expenses for international students are as follows. The cost of living in metropolitan areas such as Tokyo is higher than in rural areas. As for housing costs, the national average housing cost is 38,000 yen, while Tokyo's is 50,000 yen. Also, in metropolitan areas, it is difficult to rent apartments or other facilities near schools, so commuting to school tends to be expensive"],
    "context":[""]
    },
    {"tag":"japan_rain",
    "patterns": ["japan rain","rain in japan","rains","rains in japan","tell me about rains","what about rain","i want to know about rain in japan"],
    "responses": ["In most Japanese regions (including Tokyo), the rainy season runs from the beginning of June to mid-July. However, both the north and south of Japan experience it differently. The other thing to bear in mind is that the further west you go, the higher the chance of rain.Hokkaido and the Ogasawara islands barely experience any rain at all over these weeks. This doesn't mean the weather there is perfect, as it can be cold and cloudy during this period. In Japan's southern islands, such as Okinawa, the rainy season comes a little earlier, in May.The weather during rainy season is unpredictable. There can be heavy rain and storms at any time, though days can pass without a single drop of rain. Similarly, though the rainy season is known for its cooler temperatures, there can be sunny, hotter days.The other downside of the weather during rainy season is the humidity. It can be difficult and uncomfortable on a hot day, but generally speaking, the temperatures aren't too high over this period.For most travelers, the rainy season isn't the ideal time to visit Japan. The rain and storms which characterize the period put a lot of people off. Both the periods before and after are more popular times to go."],
    "context":[""]
    },
    {"tag":"souvenir",
    "patterns": ["souvenir","japan souvenir","souvenirs","japanese souvenirs","what souvenirs should I buy","recommend souvenirs"],
    "responses": ["To get you inspired and to know what to keep an eye out for when you're souvenir shopping in japan, here are some of my personal favourites: Tsuko-tegata (wooden passports), omamori (lucky charm), chopsticks, cerammics, pottery, maneki neko (fortune cats), Folding fans, Daruma dolls, japanese stationery, origami, tickets and maps, furoshiki cloths, cooking pan, sweat treats, umbrella and many other things I can't list anymore. Hope you can find what you like."],
    "context":[""]
    },
    {"tag":"chirstmas",
    "patterns": ["christmas in japan","japan christmas","japanese christmas","what about christmas","tell me about christmas"],
    "responses": ["Christmas has only been widely celebrated in Japan for the last few decades. It's still not seen as a religious holiday or celebration as there aren't many Christians in Japan. Now several customs that came to Japan from the USA such as sending and receiving Christmas Cards and Presents are popular. In Japan, Christmas in known as more of a time to spread happiness rather than a religious celebration. Christmas Eve is often celebrated more than Christmas Day. Christmas Eve is thought of as a romantic day, in which couples spend together and exchange presents. In many ways it resembles Valentine's Day celebrations in the UK and the USA. Young couples like to go for walks to look at the Christmas lights and have a romantic meal in a restaurant - booking a table on Christmas Eve can be very difficult as it's so popular!The traditional Japanese Christmas food is Christmas cake, but it's not a rich fruit cake, but is usually a sponge cake decorated with strawberries and whipped cream. Christmas is not a national holiday in Japan. However, often schools are closed on Christmas Day because it's near the start of the New Year school break. But most businesses will treat the 25th as a 'normal' working day."],
    "context":[""]
    },
    {"tag":"schools",
    "patterns": ["schools in japan","japan schools","schools","tell me about school","japanese schools","school"],
    "responses": ["The basic school system in Japan is composed of elementary school (lasting six years), middle school (three years), high school (three years), and university (four years). Education is compulsory only for the nine years of elementary and middle school, but 98.8% of students go on to high school. Students usually have to take exams in order to enter high schools and universities. Recently some middle and high schools have joined together to form single, six-year schools.Japanese children enter the first grade of elementary school in the April after their sixth birthday. There are around 30 to 40 students in a typical elementary school class. The subjects they study include Japanese, mathematics, science, social studies, music, crafts, physical education, and home economics (to learn simple cooking and sewing skills). More and more elementary schools have started teaching English, too. Information technology is increasingly being used to enhance education, and most schools have access to the Internet.Students also learn traditional Japanese arts like shodo (calligraphy) and haiku. Shodo involves dipping a brush in ink and using it to write kanji."],
    "context":[""]
    },
    {"tag":"spa",
    "patterns": ["spa in japan","japan spa","japanese spa","tell me about spa","which spa should i choose","recommend spa","best spa in japan"],
    "responses": ["Take a break from all the hustle-bustle and reconnect with your body at one of these spas in Japan which are equipped with all the luxury. Boasting a traditional charm, these places are the relaxing escapes offer a day where you can just give relaxation to your body and nerves and enjoy the warm water of the hot springs. These spa's or Ryokan's boast Japan's old age custom which is edged up by the modern facilities. If you can't wait to give yourself a relaxing treat, then here are the best places which should be on your list when you're in Japan. Here are the best spas in Japan which offer a relaxing escapade and also alongside that there are other facilities which cannot be missed: Maenohara Onsen Sayano, Oedo Onsen Monogatari, Toshimaen Niwanoyu, Asakusa Rox Matsuriyu and lastly, Tokyo Dome City Spa LaQua. Hope this tip will satisfy you!"],
    "context":[""]
    },
    {"tag":"social_status",
    "patterns": ["social status in japan","japan social status","social status","tell me about social status","i want to know about social status in japan"],
    "responses": ["In a survey conducted in 2019, 42.4 percent of respondents in Japan considered themselves lower middle class. Here's details: Upper class: 1.5%,Upper middle class: 15%, Lower middle class: 42.2%, Working class: 26.4%, Lower class: 9.6%, Don't know: 5.3%"],
    "context":[""]
    },
    {"tag":"social_media",
    "patterns": ["social media","social media in japan","japan social media","tell me about social media"],
    "responses": ["According to the Digital Report in 2022 by We are Social, in partnership with Hootsuite, the number of SNS active users in Japan increased by 8.7% over the previous year to 102.0 million. The percentage for the total population was 81.1%, indicating that the social media use has become the standard for many generations. Internet users was 94.0% compared to population and most using device are mobile phone, laptop and desktop with time spending about 4 hours and half. Social media users was 81.1% compared to total population and time spending in social media of most users generations 20 was about 85 minutes a day, 30s was about 40 minutes."],
    "context":[""]
    },
    {"tag":"telecommunication",
    "patterns": ["japan telecommunication","telecommunication","japanese telecommunication","what about telecommunication","telecommunication in japan"],
    "responses": ["The Japanese networks of telecommunications and of postal services are among the best and most sophisticated in the world. The use of personal computers and connections to the Internet have become nearly universal throughout the country. The government began privatizing the telecommunications industry in the mid-1980s, starting with Nippon Telegraph and Telephone (NTT), provider of domestic telecommunications services."],
    "context":[""]
    },
    {"tag":"boats",
    "patterns": ["boats in japan","how can i rent boats","boat","boats","japan boats","tell me about boats in japan","renting boat","renting boats","yatch","rent yatch","renting yatch in japan"],
    "responses": ["If you're looking for a bareboat charter in or around Japan, the price will differ depending on different things. Firstly, the exact location of your Japan boat rental will affect the price as well as how many people are on board, the time of year and the size and type of boat you choose. There are some some average prices by vessel type as following: Sailboat - 700 euro per week for 12 people, Catamaran - 20,400 euro per week in the high season and 14,000 euro per week in the low season for 8 people.Although the weather conditions vary slightly throughout the country, the best time for a yacht charter in Japan is between April and October, when the weather is warm and there is little to no rainfall. For the hottest weather, you'll want to visit in August, when you have high temperatures of 30°C.Please be careful and hope you find what you want."],
    "context":[""]
    },
    {"tag":"ports",
    "patterns": ["japan ship","ports","japan ports","ports in japan","port","japanese port"],
    "responses": ["Although total annual shipping to and from Japan has continued to rise, the Japanese shipping sector has declined steadily since the 1970s, both in terms of cargo tonnage hauled and number of ships. As a result, foreign charters and ships of foreign registry have risen in use. Japan has engaged in seafaring since early times, but large modern trading ports were not developed until the second half of the 19th century, after the country had reopened to foreign trade following a period of near isolation from the rest of the world."],
    "context":[""]
    },
    {"tag":"unemployee_people",
    "patterns": ["hikikomori","unemployee people","unemployment","japan unemployment","self isolation","unemployment in japan"],
    "responses": ["Hikikomori is a Japanese word that translates to shut oneself in. It is the repurposing of a term referring to people refusing to have contact with the outside world. According to the official categorisation of the Ministry of Health, Labor and Welfare of Japan, a hikikomori is someone who has refused contact with people for more than six months (Kawakami 2010). Similar to hikikomori, there are NEET people, an acronym identifying those who are Not in Employment, Education, nor Training. Although NEET strictly speaking only refers to people who are unemployed and unwilling to work, these two terms are frequently used interchangeably, as they are often used for people with similar characteristics. Even the Japanese Ministry of Health, Labor and Welfare grouped these two bodies when conducting a survey regarding the reality of hikikomori (Iriya 2010)."],
    "context":[""]
    },
    {"tag":"homeless_people",
    "patterns": ["homeless in japan","japan homeless","homeless people","can you tell me about homeless people in japan","homelessness"],
    "responses": ["Homelessness in Japan is a social issue primarily affecting middle-aged and elderly males. Homelessness is thought to have peaked in the 1990s as a consequence of the collapse of the Japanese asset price bubble and has largely fallen since then. According to the Special Act in regards to Supporting the Autonomy of the Homeless Population, the term homeless is defined as those who utilize city parks, river banks, roads, train stations, and other facilities as their place of stay in order to live their daily lives.Historically, men were the sole providers for their families. Japanese companies believe that married men work better than unmarried ones do because the former feel more obligations and responsibilities toward their families. Hence, not only elderly men, who face ageism and cannot find employment, but unmarried men over 35 years old have difficulties in finding employment. "],
    "context":[""]
    },
    {"tag":"communication",
    "patterns": ["communication","communication in japan","japan communication","japanese communication","what about communication"],
    "responses": ["Japanese communication style is very unique mostly because Japan was isolated to the outer world between the 16th and 19th centuries.  There also was hierarchy, similar like the Caste system in India, where the elite samurai were on top and those who took care of dead animals were at the bottom. It was very costly to become an outcast in this closely-knit hierarchical society, so people were careful not offending others. One of the most unique aspects of Japanese communication style is the lack of rejection. Japanese people rarely use the word no because rejecting someone is considered as a sign of disrespect. Because of the same reason, Japanese people use symbolism and usually make a request indirectly so that the other side doesn't have to feel the pressure. When it comes to writing, Japanese people express their ideas less clearly. Westerners usually clearly state the most important point at the beginning or ending of an essay but Japanese people vaguely mention the important point somewhere in the middle."],
    "context":[""]
    },
    {"tag":"business_communication",
    "patterns": ["business communication in japan","japan business communication","business communication","can you tell me about business communication"],
    "responses": ["The combination of Japanese vagueness and lack of comprehension leads to enormous problems which make problem-solving and decision-making very tortuous. In times of stress or difficulty during a meeting, the Japanese will often resort to silence in order to release the tension in the room and allow people to move away from the area of difficulty (to preserve the harmony or wa which is tantamount). Unfortunately many westerners are extremely uncomfortable with silence in meetings and feel the need to fill the silence with more discussion over the issue the Japanese would rather avoid.In addition, Japanese body language is very minimal, making it difficult for the untrained observer to read."],
    "context":[""]
    },
    {"tag":"drinking",
    "patterns": ["nomikai","drinking party","drinking culture","company drinking party","japan drinking party","drinking party in japn","can you tell me about drinking party"],
    "responses": ["A nomikai is a drinking party phenomenon particular to Japanese culture. Nomikai are a part of the culture of most places of employment, from schools to nightclubs. They are most often held in restaurants or izakaya, usually with everyone seated at one large table or occupying a separated section of the venue.Employees are usually expected to participate to some extent in various nomikai, as it is considered a social aspect of work, although it is not expressly required. Such parties focus on the bond between coworkers as a group, and are not considered private or somehow non-work related. Attendance does not necessarily imply that a person will drink any alcohol, however, and attendees generally pay a set amount for the food, drink, and venue regardless of consumption. Any leftover money may be put toward organizing the next nomikai.The student version of the nomikai is called a konpa and contains some distinguishing characteristics."],
    "context":[""]
    },
    {"tag":"drunk_people",
    "patterns": ["drunk in japan","drunk people","japanese drunk","can you give me information about drunk","japan drunk","booze"],
    "responses": ["Japan is a booze lover's paradise. For centuries alcohol has mixed into the local culture, creating friendships and sealing business deals on a daily basis.In Japan, alcohol is easier to find than a packet of gum. Hard spirits are sold in every konbini (convenience store)or street vending machines and these ubiquitous mini-marts never close. Liquor license laws for serving alcohol are lax, so booze can be sold for immediate consumption at just about any event or establishment.It's clearer than vodka that drinking plays an important role in Japanese society that we called nomikai and Drinking with coworkers is a part of the job.Most of us are acquainted with negative effects of consuming too much alcohol like impaired judgment, blurry vision, nausea, going home with someone maybe you shouldn't have, and, of course, the dreaded hangover.However, there are less discussed issues. Like, how in the worst cases, too much alcohol can lead to stress, violence, and addiction.But people in Japan aren't talking about this much. In fact, people aren't really talking about it at all. So, we have to look at statistics to see how bad it really is."],
    "context":[""]
    },
    {"tag":"advertisement",
    "patterns": ["advertisement in japan","japan advertisement","advertising","what about advertisement","can you tell me about advertisment in japan"],
    "responses": ["The Japanese advertising market is one of the largest advertising markets worldwide. Total advertisement spending saw stable growth until the spread of the novel coronavirus (COVID-19) in 2020, which led to a decrease of the market size by about 780 billion Japanese yen. In 2021, the market recovered considerably and reached a value of 6.8 trillion yen, which was close to pre-COVID-19 levels. Given its size, the advertising market is one of the most important markets for Japan. It regularly accounts for more than one percent of the country's nominal gross domestic product (GDP). And as a result, it leads to Rising expenditures for online advertising, Largest advertising agencies and it also establishs a memorable connection with audiences."],
    "context":[""]
    },
    {"tag":"mental_health",
    "patterns": ["mental health in japan","can you give me information about mental health","psychology","japan mental health","mental health"],
    "responses": ["In particular, the protracted COVID-19 pandemic had a major impact on the mental health of women and young people in Japan and it altered suicide trends in the country.The Organization for Economic Cooperation and Development reported that the prevalence of depression in Japan doubled to 17.3% in 2020, up from 7.9% in 2013, while the number of suicides in Japan in 2020 increased for the first time in 11 years.In Japan, only 6% of people have used psychological counselling for mental health problems, compared to 52% in Europe and the US.One of the reasons for the low penetration of counselling in Japan is the ingrained belief that enduring what is unacceptable is a virtue. Japanese people are reluctant to confide their mental difficulties to those closest to them and try to survive and overcome their mental illnesses."],
    "context":[""]
    },
    {"tag":"average_age",
    "patterns": ["average age in japan","japan average age","longevity","japan longevity","can you give me information about average age in japan"],
    "responses": ["In 2020, median age of population for Japan was 48.36 years. Median age of population of Japan increased from 22.35 years in 1950 to 48.36 years in 2020 growing at an average annual rate of 5.68%."],
    "context":[""]
    },
    {"tag":"average_height",
    "patterns": ["average height in japan","japan average height","can you give me information about average height","height in japan","japan height","height"],
    "responses": ["The data belongs to Japan Sports Agency, 2018.17-year-old Japanese men's height average is 170.7 cm (5 feet 7.2 inches) and 17-year-old Japanese women's height average is 157.8 cm (5 feet 2.1 inches). We would also like to mention the weight average, 17-year-old men weigh in at 137.7 Ibs (62.5 kg) and women at 116.6 Ibs (52.9 kg). It can be observed from the statistics given that the new generation's average height is not higher than the 20-49-year-old Japanese people. According to Japan's National Health and Nutrition Survey, the average height for a man in Japan was only 160.3 cm (5 feet 3.1 inches) and the average height for women in Japan was only 148.9 cm (4 feet 10 inches) 70 years ago, which shows that there is approximately 10 cm height increase in Japan over the 70 years."],
    "context":[""]
    },
    {"tag":"average_weight",
    "patterns": ["average weight in japan","japan average weight","can you give me information about average weight","weight in japan","japan weight","weight"],
    "responses": ["Men weigh in with 62.5kg (138lbs) and women with 52.9kg (117lbs)"],
    "context":[""]
    },
    {"tag":"nature",
    "patterns": ["nature in japan","how beautiful is nature in japan","japan nature","can you tell me about nature in japan"],
    "responses": ["Many visitors to Japan limit their sightseeing activities to the country's heavily urbanized areas between Tokyo, Kyoto and Hiroshima. As a result, many return home with a hardened misconception that Japan is one large, densely populated megacity. In fact, however, over two thirds of Japan are covered by forested mountains and hills, compared to less than ten percent residential and industrial land.The Japanese archipelago stretches nearly 3000 kilometers from north to south, allowing visitors to experience a wide range of natural sights from the drift ice in the seas off Hokkaido to the mangrove jungles in Okinawa. In between, there are majestic volcanoes, breathtaking coastlines and vast forests inhabited by monkeys, bears, deer, cranes and other wildlife. Places of particular natural beauty are protected as national parks and world heritage sites."],
    "context":[""]
    },
    {"tag":"metropolis",
    "patterns": ["big cities","metropolis","urban settlemens","urban","big city","urban people"],
    "responses": ["Except for the former capital cities of Nara, Kyoto, and Kamakura, no sizable town of any significance appeared before the 16th century. the majority of Japan's important cities, including Tokyo, developed from them. Next in importance were the port towns, such as Hakata and Sakai, which experienced more vicissitudes than the castle towns. With industrialization came the rapid growth of Japanese cities, and some of the industrial towns (e.g., Yawata, Niihama, Kawasaki, and Amagasaki) were founded in response to economic development."],
    "context":[""]
    },
    {"tag":"countryside",
    "patterns": ["countryside","rural","rural life","rural people","japanese countryside","rural settlements"],
    "responses": ["From the late 19th century, economic and social changes affected even the remotest rural villages, but many traditional aspects of rural life have survived. Although these differences are only superficial, the traditional ties that bind the inhabitants together to form a firm village community are changing as industry moves into the countryside and offers farmers attractive employment options. No village is regarded as purely rural."],
    "context":[""]
    },
    {"tag":"house_garden",
    "patterns": ["house garden","garden","japan garden","gardening","japan gardening","japanese garden"],
    "responses": ["Japanese gardens are considered as the miniature versions of vast landscapes. Rocks symbolize mountains, bushes represent forests and ponds are reference seas and lakes. There are three main types of Japanese gardens: pond garden, rock garden and the courtyard garden. The pond garden is the most popular type of Japanese garden adopted from Chinese culture. The rock garden (karesansui), also known as the zen garden, consists of white pebbles and stones often found in zen monasteries in Kyoto. The courtyard garden (tsubo niwa) is a miniature garden built inside traditional houses. The courtyard garden is usually located in the middle of a house to get more sunshine indoors and help the residents feel like living in nature"],
    "context":[""]
    },
    {"tag":"samurai",
    "patterns": ["what about samurai","japan samurai","japanese samurai","what is samurai","samurai"],
    "responses": ["Samurai means the one who serves the master.Although the samurai were the elite warrior class, the meaning of the word is not warrior.In the past, there was a social hierarchy in Japan and the samurai class was on the top of the chain. Commoners had to bow in front of the samurai and avoid eye-contact. The samurai used to follow the code called Bushido. Bushido consisted of 7 values including courage, respect, honor and loyalty. It is said that most Japanese people do not change jobs and work so hard for their companies as a result of the Bushido culture. Japanese companies usually do not advertise against their competitors because of the respect the enemy rule in the samurai culture."],
    "context":[""]
    },
    {"tag":"ninja",
    "patterns": ["what about ninja","japan ninja","japanese ninja","what is ninja","ninja"],
    "responses": ["In Japanese, ninja are usually called shinobi which means spy. Ninja were most active in the 1600s and 1700s being hired as spies and assassins for the daimyos.  There were only 2 regions in Japan, Iga and Koga, where people could become a ninja. Although their image is usually associated by assassination, most of the time they were spies who could walk very silently, run very fast and make poisons and explosives. Since the ninja could not own horses and did not carry swords, they had to run so fast in order to survive. Some ninjas could run more than 50km in one day. They also did not wear black uniforms and preferred casual clothes as they did not want to stand out as a spy."],
    "context":[""]
    },
    {"tag":"sword_arts",
    "patterns": ["sword art in japan","sword art","sword arts","japan sword arts","kendo","kendo in japan","can you give me information about sword art in japan","kenjutsu"],
    "responses": ["Kenjutsu is an umbrella term for all (ko-budo) schools of Japanese swordsmanship, in particular those that predate the Meiji Restoration. Some modern styles of kendo and iaido that were established in the 20th century also included modern forms of kenjutsu in their curriculum. Kenjutsu, which originated with the samurai class of feudal Japan,means methods, techniques, and the art of the Japanese sword. This is opposed to kendo, which means the way of the sword and uses a bamboo sword (shinai) and protective armour (bogu)."],
    "context":[""]
    },
    {"tag":"martial_arts",
    "patterns": ["judo","jijitsu","martial arts","what about martial art","martial art","martial","japan martial arts"],
    "responses": ["The focus of martial arts is not beating the enemy but building a strong personality and character. Japanese people believe martial arts should be used for self-defense only. Most Japanese policemen practice Aikido to catch criminals. While Karate, judo and Aikido emerged in the 19th century, the samurai class practiced martial arts in the past for unarmed combat. There are so many different types of martial arts in Japan including kyudo, ninjutsu, kendo, jujitsu, naginatajutsu and etc.. These are the principles of martial arts in Japanese Culture a) Dojo is a sacred place, it must be clean, safe and quiet b) Students can only learn by watching the sensei c) Mental strength is more important than body strength d) Cleaning the dojo is part of the training e) Show respect to your opponent at all times f) You must memorize kata: simulated defense moves g) Junior members must follow and obey senior members."],
    "context":[""]
    },
    {"tag":"stalkers",
    "patterns": ["japan stalkers","stalker","stalkers in japan","stalker","what should i do if i met stalker","can you tell me about stalker","stalking","stalking in japan"],
    "responses": ["Most stalkers target people they know. Many stalkers commit this crime against people who they've dated/been romantically involved with. Stalkers may also be acquaintances, family members, and/or strangers.Most stalkers use multiple tactics to scare their victims. These behaviors may include (but are not limited to): Unwanted contact through repeated calls (including hang-ups), texts, e-mails or messages, Following you, Sending unwanted gifts or letters, Tracking you using technology (like GPS, apps, or hidden cameras), Showing up or waiting for you at your home, work, or school, Damaging your property, Spreading rumors about you - in person or online, Posting, sharing, or threatening to post intimate photographs of you, Harassing your coworkers, family, or friends,Threatening to hurt you or those close to you - family, friends, pets,Other actions that control, track, or frighten you...It can be helpful to think of strategies to help keep yourself and loved ones safe. You may want to: Call 110 if you're in imminent danger or have been threatened, Trust your instincts. If you think that you're in danger, you probably are, Connect with a local victim service provider who can help you explore options and make a detailed safety plan."],
    "context":[""]
    },
    {"tag":"archery",
    "patterns": ["archery in japan","japan archery","japanese archery","can you tell me about archery","what about archery","archery"],
    "responses": ["Kyuodo is the Japanese martial art of archery. Kyuodo is based on kyuojutsu (art of archery), which originated with the samurai class of feudal Japan. In 1919, the name of kyuojutsu was officially changed to kyuodo, and following the example of other martial arts that have been systematizing for educational purposes, kyuodo also reorganized and integrated various forms of shooting that had been used up until then. High level experts in kyuodo may be referred to as kyuodoka(Kyudo Master) and some practitioners may refer to themselves as yumihiki ), or 'bow puller'. Kyuodo is practised by thousands of people worldwide. As of 2005, the International Kyudo Federation had 132,760 graded members. The bow they use is called a yumi, and the most common one has an asymmetrical shape of more than 2.0 metres (6 ft 7 in), and is characterized by the archer holding the part of the bow below the center to shoot the arrow."],
    "context":[""]
    },
    {"tag":"weapons",
    "patterns": ["weapons in japan","weapon","weapons","japanese weapon","japan weapon","tell me about japanese weapon"],
    "responses": ["There are some types of weapons I can inform you. However, you should just avoid to possess or use any weapons in this list to injure anyone in reality if you don't want to be arrested by your country's government. Here's a list of Japanese weapons: THE KATANA: JAPAN'S FAMOUS BLADES, TEKKAN AND HACHIWARI: JAPAN'S NOT-SO-FAMOUS BLADES, GUNSEN, TESSEN, AND GUNBAI: FANS OF WAR, KISERU BATTLE PIPES: SMOKE YOUR ENEMIES, KAMA: THE SICKLE, MANRIKI-KUSARI: THE TEN-THOUSAND POWER CHAIN, KUSARIGAMA: THE BEST OF BOTH WORLDS,CHIGIRIKI: THE JAPANESE MACE, YUMI: DEATH FROM AFAR, FUKIYA: DEATH FROM NOT-SO-AFAR, FIRE ARROWS AND BOHIYA, HOROKUBIYA: BOMBS AWAY, HIYA TAIHOU: SAMURAI ROCKET LAUNCHERS, TANEGASHIMA (JAPANESE MATCHLOCK): FIREARMS, SHURIKEN: THROWING DEATH, KUNAI: CAN YOU DIG IT?, TESTUBISHI OR MAKIBISHI: WATCH YOUR STEP, YAWARA: DEATH IN THE PALM OF YOUR HAND, ONO: NOT JUST FOR FALLING TREES, TOBIGUCHI: NOT JUST FOR FIGHTING FIRES, BO AND JO: THE LONG AND SHORT OF IT, OTSUCHI: NOT JUST FOR NAILS, KYOKETSU-SHOGE: RISE TO NEW HEIGHTS, JUTTE: DISARMAMENT, SASUMATA: RESTRAINT, TORINAWA: ROPE-A-DOPE EDO STYLE, SHUKOU & ASHIKOU: CLIMBING CLAWS, TEKKO-KAGI: CLAWS OF DEATH, KAKUTE: DEATH RINGS, NEKOTE: CAT SCRATCH FEVER,...    "],
    "context":[""]
    },
    {"tag":"diving",
    "patterns": ["diving in japan","where can i dive","japan diving","can you tell me about diving in japan","scuba","japan scuba","scuba in japan"],
    "responses": ["outhern Japan (Kyushu and Okinawa) consists of hundreds of islands and islets in the very deep south of the Japanese archipelago. It's warm year-round with temperatures around 68°F (20°C) in winter and 88°F (31°C) during the summer, making it ideal for crystal clear waters, white sand, and colorful fish. Japan is also volcanic with a fascinating underwater topography such as steep vertical walls and interesting rock formations. A lot of the islands in southern Japan and south of the capital Tokyo were formed from volcanic eruptions, and as dive guides will explain, this is plain to see when you go diving. The peak season for diving begins at the end of the rainy season in mid-July and runs until early to mid-September when the warm weather ends.The Kuroshio Current also flows northward on the Pacific side of Japan and warms the seas as far north as Tokyo, usually around May.Divers in Japan enjoy an array of sites offering a combination of drift diving, wreck diving and shore dives in a flourishing underwater world. Or you can choose some other spots for example:Ishigaki Island (Okinawa), Kerama Islands, Miyakojima, Tokunoshima, Miyakejima,Osezaki, Hachijojima, Yoronto, Shiretoko Peninsula(Hokkaido). Hope you have nice diving trips!"],
    "context":[""]
    },
    {"tag":"harvesting",
    "patterns": ["harvesting in japan","what can harvest in japan","harvesting","harvest","can you tell me about harvest","japan harvest"],
    "responses": ["Non-paddy farmland share the terraces and lower slopes and are planted with wheat and barley in the autumn and with sweet potatoes, vegetables, and dry rice in the summer.In 1990, Japan was 67% self-sufficient in agricultural products and provided for around 30% of its cereal and fodder needs.As an attempt to consolidate farmland and increase productivity, Farmland Intermediary Management Organizations (nochi chuokan kanri kiko),also known as Farmland Banks, were introduced as part of a reform package in 2014, which also included the reform of local Agricultural Committees."],
    "context":[""]
    },
    {"tag":"sea_food",
    "patterns": ["sea food in japan","japan sea food","i want to eat sea food","can you tell me about sea food in japan","sea food"],
    "responses": ["Japan is famous for a lot of things, and Japanese seafood is definitely one of them! Surrounded by bountiful oceans in every direction, the country has brought forth amazing seafood creations, both modern and traditional. Here are 10 must-try Japanese seafood varieties, for foodies and beginners! Unagi Japanese Freshwater Eel, Uni Sea Urchin, Shishamo Willow Leaf Fish, Maguro Bluefin Tuna, Ika & Tako Squid and Octopus, Hotate Scallops, Fug Pufferfish, Ikura Salmon Roe, Kamaboko Fish Cake, Ebi Shrimp. Hope you have good meals and enjoy Japanese sea food!"],
    "context":[""]
    },
    {"tag":"waterfall",
    "patterns": ["waterfall in japan","japan waterfall","waterfall","tell me about waterfall"],
    "responses": ["Some of the most beautiful waterfalls in Japan are actually not far from Tokyo. But when asked to picture Tokyo, most people tend to visualize a high-tech, urban environment teeming with people forever on the move. While this isn't entirely inaccurate, the greater Tokyo area has so much more to offer those less inclined to city life. For those looking to experience the great outdoors without venturing far from the city, we've put together a list of breathtaking waterfalls in Japan that can all be visited as day trips from Tokyo: Kegon Falls - Tochigi Prefecture, Nomizo no Taki - Chiba Prefecture, Nishizawa Gorge (Nanatsugama Godan no Taki) - Yamanashi Prefecture, Shasui Falls - Kanagawa Prefecture, Hossawa Falls - Tokyo Prefecture, Shiraito Falls - Shizuoka Prefecture, Fukuroda Falls - Ibaraki Prefecture, Ryuzu Waterfall - Tochigi Prefecture."],
    "context":[""]
    },
    {"tag":"boarder_guard",
    "patterns": ["boarder guard","coast guard","border guard in japan","can you give me information about border guard in japan","territory","japan territory"],
    "responses": ["The Japan Coast Guard (Kaijo Hoan-cho) is the coast guard of Japan. The Japan Coast Guard consists of about 13,700 personnel and is responsible for the protection of the coastline of Japan under the oversight of the Ministry of Land, Infrastructure, Transport and Tourism. The Japan Coast Guard was founded in 1948 as the Maritime Safety Agency and received its current English name in 2000. They have 4 main missions as following: Maritime law enforcement and national security, Search and rescue and disaster response, Hydrographic and oceanographic surveying and Maritime traffic management."],
    "context":[""]
    },
    {"tag":"disputed_areas",
    "patterns": ["disputed area in japan","japan disputed area","disputed area","give me information about disputed area","conflict area","disputed island","disputed islands"],
    "responses": ["The Senkaku Islands dispute, or Diaoyu Islands dispute, is a territorial dispute over a group of uninhabited islands known as the Senkaku Islands in Japan, the Diaoyu Islands in the People's Republic of China (PRC), and Tiaoyutai Islands in the Republic of China (ROC or Taiwan)."],
    "context":[""]
    },
    {"tag":"time_zone",
    "patterns": ["time zone in japan","japan time zone","tell me about time zone in japan","time zone","timezone","japan timezone"],
    "responses": ["Time zone in Tokyo, Japan (GMT+9)"],
    "context":[""]
    },
    {"tag":"natural_resources",
    "patterns": ["japan natural resource","environment managment","natural resource management","japan natural resource management"],
    "responses": ["For example, in terms of environment and forest resources management, industrial pollution control, agricultural land shrinking and management, international treaties to oil, gas or mineral resources exploration, foreign investment for infrastructural development, fiscal deficit etc. Political parties can blend their values for sustainable management. Regarding the Confucianism ideology and collective development, Japan has issued their forest policies, water management policies, energy policies and mineral resources management policies. But their law, policy, research, institutional and engineering capacity combine the industrial human resources and lower amount of natural resources.The features of Japanese approaches to environmental resources management are very unique. These are home grown philosophy in Japan, help them to power sharing capacity, relative decentralization, natural ethics, pollution control agreement between governmnet and industries for sustainable environmental resources management."],
    "context":[""]
    },
    {"tag":"spices",
    "patterns": ["spice in japan","japan spice","spice","japanese spice","tell me about japanese spice","japanese spice","spices"],
    "responses": [" In Japanese cooking, I can list for you some of common spices in Japanese dishes you may want to know: Shichimi Togarashi (Japanese Seven Spice Blend), Wasabi (Japanese Horseradish), Katsuobushi (Bonito Flakes), Japanese Mayonnaise, Yuzu Kosho (Citrus Chili Paste), Tonkatsu Sauce, Ponzu (Citrus Sauce), Rayu (Chili Oil), Furikake (Rice Seasoning), Aonori (Dried Seaweed Flakes), Karashi (Spicy Mustard) and Sansho Pepper. "],
    "context":[""]
    },
    {"tag":"nutrition",
    "patterns": ["nutrition in japan","japan nutrition","nutrition","can you give me information about japanese nutrition","japanese nutrition"],
    "responses": ["The traditional Japanese diet is rich in minimally processed, fresh, seasonal foods. It contains very small amounts of added sugars, fats, or animal protein and promotes fish, seafood, rice, noodles, seaweed, soy, fruit, and vegetables.How can you follow the traditional Japanese diet: Staple food: steamed rice or soba, ramen, or udon noodles, Soup: typically a miso soup made with seaweed, shellfish, or tofu and vegetables in a fermented soybean stock — though vegetable or noodle soups are other popular options, Main dish: fish, seafood, tofu, or natto with optional small amounts of meat, poultry, or eggs and Side dishes: vegetables (raw, steamed, boiled, sautéed, grilled, or pickled), wild plants, seaweed, and raw or pickled fruit."],
    "context":[""]
    },
    {"tag":"shipping",
    "patterns": ["shipping in japan","japan shipping","shipping","tell me about shipping","what about shipping","shipper","what about shipping company","shipping company","shipment","moving service","house moving"],
    "responses": ["Buying souvenirs in a foreign county when you go on a vacation is one of the fun things to do. Carrying heavy luggage can be stressful when you are traveling from place to place.Don't worry. I will be listing up 10 best shipping services in japan as following: EMS (Japan Post), SAL (Japan Post), Surface Mail (Japan Post), Yamato Transport, FedEx, Sagawa Express, Nippon Express, DHL, Seino Transportation and UPS. For who want to use moving goods services in Japanese territory, I can recommend some companies as following: Yamato Transport, Sakai Moving Service, Art Corporation and Dekataku. Good luck!"],
    "context":[""]
    },
    {"tag":"repair",
    "patterns": ["fixing","repair","household repair","repairing in japan","japan fixing","repair in japan","repairing company","repair company","repair companies","maintenance","maintenance in japan"],
    "responses": ["There are some repair and maintenance companies I can recommend from top searching in google, you can consider one of them: Hoshizaki, Glassdoor, Japanrepair, Fruehauf, Sankyo-seisakusho, Mrojpn, Mitsubishicorp, Aoyama-syouji and Marient."],
    "context":[""]
    },
    {"tag":"mechanics",
    "patterns": ["mechanics in japan","mechanic","japan mechanic","give me information about mechanic"],
    "responses": ["Japan is brimming with wide ranging job opportunities especially to skilled workers such as automotive mechanics. For foreigners who want to pursue an automotive mechanic job career in the country, learn the basics of how to successfully qualify for a competitive automotive mechanic job in Japan. As of June 30, 2022, around 331.68 thousand certified auto mechanics worked in Japan's repair shops, decreasing by 0.8 percent year-on-year. There were approximately five employees per business on average.The average mechanic gross salary in Japan is ¥4,444,579 or an equivalent hourly rate of ¥2,137. In addition, they earn an average bonus of ¥147,560. Salary estimates based on salary survey data collected directly from employers and anonymous employees in Japan."],
    "context":[""]
    },
    {"tag":"biology",
    "patterns": ["biology in japan","biology","japan biology","give me information about biology"],
    "responses": ["The National Institute for Basic Biology (NIBB) is a research institute and post graduate university in Okazaki City, Aichi Prefecture, Japan. It was founded in 1977 to promote biological research in Japan in cooperation with public and private universities, and research institutes.Though the institute's primary focus is basic biology, research there covers a wide variety of biological fields, such as cell biology, developmental biology, neurobiology, evolutionary biology, environmental biology, and theoretical biology, The results of the research conducted at NIBB are regularly published in peer reviewed publications such as Science, Nature, and the Proceedings of the National Academy of Sciences. It constitutes the Department of Basic Biology in the School of Life Science of the Graduate University for Advanced Studies (SOKENDAI). The Department offers a five-year Doctoral program for university graduates and a three-year senior Doctoral course for students who have already completed a Master's course."],
    "context":[""]
    },
    {"tag":"chemistry",
    "patterns": ["chemistry in japan","chemistry","japan chemistry","give me information about chemistry"],
    "responses": ["In Japan, many chemical breakthroughs contributing to health and wealth have occurred. Since 2000, six Japanese scientists have been awarded Noble Prizes in Chemistry.If you're interested in studying a Chemistry degree in Japan you can view all 11 Bachelors programmes. You can also read more about Chemistry degrees in general, or about studying in Japan. Many universities and colleges in Japan offer English-taught Bachelor's degrees. Here are the best global universities for chemistry in Japan: University of Tokyo,Kyoto University,Osaka University,Hokkaido University,Tokyo Institute of Technology,Kyushu University,Nagoya University,Tohoku University."],
    "context":[""]
    },
    {"tag":"fashion",
    "patterns": ["japan fashion","japanese fashion","what about fashion","what about japan fashion","can you tell me japan fashion"],
    "responses": ["There are some kinds of special fashion you only can find in Japan, let's take a look: 1.Harajuku girl ,2. Cosplayers ,3. Street fashion, 4.Hipster, 5.Hostess/Hosuto, 6. Mori Kei, 7.Gothic Lolita, 8.Sweet Lolita (ama rori), 9.Punk lolita, 10.Wa lolita, 11. Yamanba, 12. Yanki and Bosozoku, 13.Rockabilly, 14.Dekora, 15.Promo models, 16.Gyaru, 17.Kogals, 18.Gyaruro, 19.Fairy Kei, 20.Visual Kei "],
    "context":[""]
    },
    {"tag":"computer_science",
    "patterns": ["computer science in japan","computer science","japan computer science","give me information about computer science in japan"],
    "responses": ["Universities, labs and research centers will give you access to the best technologies worldwide. A degree in computer science in Japan opens the door to numerous job opportunities, not only in the country (under the condition that you are fluent in Japanese) but anywhere else in the world.Japan has a consistent demand for programmers. In fact, the Ministry of Economy, Trade, and Industry estimates a deficit of 789,000 software engineers by 2030.Best Global Universities for Computer Science in Japan: University of Tokyo,Kyoto University,Tohoku University,Tokyo Institute of Technology,Osaka University,Kyushu University,Waseda University,Nagoya University."],
    "context":[""]
    },
    {"tag":"utilities",
    "patterns": ["utility","utilities in japan","japan utility","utility in japan","what about utility","utilities"],
    "responses": ["It's advisable to apply for utilities one week before you move into your new apartment in Japan, but it's even better to make the call pronto. However, the utility company will require a little information from you before they can process your application:Your full name, The address of the place you're moving into, The date you want to start the service, Your phone number. You may want to buy a SIM card first to contact .There are some guide for you for example: To start using electricity in your house or apartment in Japan, you will need to open an electricity account. This can be done by contacting the call center of the electric power companies. Gas is probably the most challenging utility to set up because you will actually need to be in your new apartment. The gas technician will come in person to turn on your gas line. There will probably be a small gap between the time you move in and the time your gas turns on, so it's probably a good idea to plan your bath accordingly. Perhaps the easiest out of the three basic utilities in Japan, your home's water supply line is usually left on, so you don't have to worry about turning it on when you move in. "],
    "context":[""]
    },
    {"tag":"air_conditioner",
    "patterns": ["air condition in japan","air condition","japan air condition","tell me about air condition","air conditioning"],
    "responses": ["Due to hot and humid climate in the summer, most Japanese households do have air conditioning — about 90%, the same as the US — but it's used slightly differently. The most popular model in Japan is a mini split system of separate, ceiling-mounted units that are individually controlled. I can recommend for you 7 Best Japanese Air Conditioner Brands:Panasonic, Hitachi, Mitsubishi Electric, Daikin, Toshiba, Fujitsu and Amadana."],
    "context":[""]
    },
    {"tag":"police",
    "patterns": ["japan police","japanese polices","police","police in japan","polices","what about police"],
    "responses": ["Japan's police services are under the administration of the National Public Safety Commission, headed by a cabinet minister. There also are a number of more specialized policing bodies, the largest of which, the Maritime Safety Agency, patrols Japan's coastal waters. Japan's crime rate is low compared with that of most countries, especially for violent crimes—in part because of the severe restrictions placed on the possession of firearms."],
    "context":[""]
    },
    {"tag":"medicine",
    "patterns": ["medicine","medicine in japan","japan medicine","biomedical"],
    "responses": ["Japan is also a global leader in the area of biomedical research along with the United States and elsewhere. In 2015, the country established the Japan Agency for Medical Research and Development to help implement biomedical research and development projects and improve the support infrastructure for clinical research. Medical research in Japan typically takes place in various national university and private university research hospitals. These research hospitals include University of Tokyo Hospital, Tohoku University Hospital, and Keio University Hospital among others."],
    "context":[""]
    },
    {"tag":"justic",
    "patterns": ["law in japan","justic in japan","japan justic","japan laws","laws","justic","what about japan laws"],
    "responses": ["The judicial system consists of three levels: the Supreme Court, eight high (appellate) courts, and a district court and a family court in each prefecture (except for Hokkaido, which has four). Other than those minor cases, district and family courts are the courts of first instance—except for cases involving insurrection, which are tried in the high courts. The Supreme Court consists of a chief justice and 14 other justices."],
    "context":[""]
    },
    {"tag":"language",
    "patterns": ["language in japan","japan language","japanese language","what about language"],
    "responses": ["Japanese is the national language, and Ainu is almost extinct. Until that time Japanese had no written form, and at first Chinese characters (called kanji in Japanese) were used to write Japanese; Standard Japanese, based on the dialect spoken in Tokyo, was established in the late 19th century through the creation of a national educational system and through more widespread communication. There are many local dialects, which are often mutually unintelligible, but standard Japanese, widely used in broadcasting, is understood nationwide.Japanese is broadly divided linguistically into the two major dialects of Hondo and Nanto."],
    "context":[""]
    },
    {"tag":"restaurant",
    "patterns": ["restaurant in japan","japan restaurant","restaurant","japanese restaurant","i want know about japanese restaurant","restaurants"],
    "responses": ["If you have a chance to visit or live in Japan, here's some types of restaurants you should know. For Specialized Japanese restaurants, we have: Sushi-ya, Kaitenzushi, Soba-ya and udon-ya, Ramen-ya, Kare-ya, Gyudon-ya, Yakitori-ya, Okonomiyaki-ya , Tonkatsu-ya , Tempura-ya , Unagi-ya, Sukiyaki-ya and shabu shabu-ya , Teppanyaki-ya. For General restaurants: Izakaya, Family restaurant,Shokudo, Teishoku-ya, Kissaten and coffee shops, Kaiseki ryori and ryotei , Yatai.With foreign restaurants: Yakiniku-ya, Chinese restaurants , Yoshoku-ya, Italian restaurants, French restaurants, Hamburger fast food, Indian restaurants and Ethnic cuisine.  "],
    "context":[""]
    },
    {"tag":"village",
    "patterns": ["village in japan","japan village","village","japanese village","i want know about japanese village","villages"],
    "responses": ["While major cities like Tokyo, Kyoto, and Osaka are world-famous Japanese tourist destinations, if you're seeking a little more tranquility on your travels, you might be better suited journeying to one of Japan's countryside villages. Here's a list for you: Biei (Hokkaido), Tsurui (Hokkaido), Higashinaruse (Akita), Kitashiobara (Fukushima), Kiso (Nagano), Kiso (Nagano), Hayakawa (Yamanashi), Totsukawa (Nara), Yoshino (Nara), Ine (Kyoto), Kamikatsu (Tokushima), Kamijima (Ehime), Minamioguni (Kumamoto), Shiiba (Miyazaki), Kikai (Kagoshima)."],
    "context":[""]
    },
    {"tag":"temple",
    "patterns": ["temple in japan","japan temple","temple","japanese temple","i want know about japanese temple","temples","shrines","japanese shrine","Monasteries"],
    "responses": ["Temples (tera) are the places of worship in Japanese Buddhism. Virtually every Japanese municipality has at least one temple, while large cultural centers like Kyoto have several hundred. Best Temples in Japan for you:Hida-Sannogu Shrine in Takayama, Hasedera Temple in Kamakura, Enryaku-ji in Kyoto, Meiji Jingu Shrine in Tokyo, Kiyomizu Temple in Kyoto, Fushimi Inari Taisha Shrine, Classic Japan at the Itsukushima Shrine, Nezu Shrine in Tokyo, Senso-ji Temple at Asakusa in Tokyo and Kinkakuji Temple or the Golden Pavilion in Kyoto. "],
    "context":[""]
    },
    {"tag":"anime_store",
    "patterns": ["anime store in japan","japan anime store","what about anime store","anime store","buy anime goods","anime goods","anime store online","japanese anime store"],
    "responses": ["First, you can buy anime goods directly from Anime studios and licenses online stores such as: Aniplex Plus, Pokémon Center Online, Kyoani Shop (Kyoto Animation).Here's some website for you: Animate Online Shop, Surugaya, Premium Bandai, Kotobukiya, Amazon Japan. If you want to buy doujinshi, fan-made works, here's a list for you: Melonbooks, Comic Toranoana, Pixiv Booth. Places to buy rare second-hand anime goods: Mandarake, Otamart, Mercari Japan and Yahoo Auctions Japan."],
    "context":[""]
    },
    {"tag":"cosplay",
    "patterns": ["cosplay in japan","japan cosplay","what is cosplay","japanese cosplay","tell me about cosplay","cosplay","best cosplay","cosplayer"],
    "responses": ["Cosplay, a portmanteau of costume play, is an activity and performance art in which participants called cosplayers wear costumes and fashion accessories to represent a specific character. Cosplayers in Japan used to refer to themselves as reiya. Currently in Japan, cosplayers are more commonly called kosupure, pronounced kosupray, as reiya is more often used to describe layers. Here's Japanese cosplayers of top search in google I can inform you: Ori Moe, Jun, Kaname, Reika Arikawa, Sakuya Sakuya, Kippi, Ami Hayase, Enako, Otogi Nekomu, Skirt, Kizaki Urumi and Saki Miyamoto."],
    "context":[""]
    },
    {"tag":"aesthetics",
    "patterns": ["aesthetics in japan","japanese aesthetics","japan aethetics","aethetic","aethetics","beauty opinion","what is aethetics"],
    "responses": ["Japanese arts were influenced by Zen Buddhism where minimalism, modesty and simplicity are very important. The perception of beauty is different from the ideal beauty concept in the West. Japanese artisans believe things that are old, asymmetrical and natural are more aesthetically appealing than perfectly symmetrical new objects. Silence, open space, elegant simplicity and rustic patina are always visible in all aspects of Japanese arts."],
    "context":[""]
    },
    {"tag":"symbols",
    "patterns": ["japanese symbol","symbol","symbols","what about japanese symbols","what about symbol","japan symbol"],
    "responses": ["Japan has an indirect communication style, so there are many symbols in everyday life. Some of the Japanese symbols and their meanings are 1- Salt: Purity 2- Crane: Longevity 3- Sakura: Beautiful things don't last long 4- Carp: Perseverance 5- Red Gate: The door to the sacred world 6- Dragon: Strength 7- Chrysanthemum flower: Imperial family 8- Japanese flag: The Sun 9- Round Circle: Universe 10- Beckoning Cat: Good fortune & money."],
    "context":[""]
    },
    {"tag":"literature",
    "patterns": ["literature","japan literature","japanese literature","what about japanese literature","can you tell me about japan literature"],
    "responses": ["Japanese literature refers to the written materials produced by Japanese authors in the past. The two most well-known Japanese literary works are the tale of genji, and haiku poems. The tale of Genji is a novel written in the 11th century which is sometimes called the world's first novel. It is a story about a prince who was kicked out of the imperial family and had love affairs among commoners. Haiku is the name given to minimalistic poems that consist of three phrases uttered in 17 syllabi (5-7-5). The topic is usually about seasonal changes and the phrase in the middle connects two distant concepts. Recently, Haruki Murakami became famous for his novels based on strange characters and absurd moments of life. His style is considered Western but his novels still reflect everyday life in Japan."],
    "context":[""]
    },
    {"tag":"folk_stories",
    "patterns": ["folk stories","folk story","what about folk story"," japan stories","japan story"],
    "responses": ["Japanese folklore and folktales are heavily influenced by Chinese culture and collective norms of the isolated Japanese islands. The Short stories and folk tales always try to teach the importance of patience, honesty, and hard work. The stories usually include 1- Old grandpa and grandma 2- A strong little boy 3- A beautiful little girl who grows up to be a princess 4- Devil (Oni) 5- Samurai. Samurais usually cooperate with the protagonist. 6- Forest 7- An animal that turns out to be a human or a creature with supernatural powers. The most famous children story is perhaps Momotaro (the peach boy). An old woman finds a tiny boy inside the seed of a peach. The little boy grows up by eating the dumplings made by the old lady. He then goes to the demons' island and retrieves the treasures stolen by the demons. He gets help from 3 animals during his fight agains the demons: a monkey, a dog and a bird."],
    "context":[""]
    },
    {"tag":"mythology_legends",
    "patterns": ["mythology","what is mythology","japan mythology","japan mythology","japanese mythology","legends","japan legends","what about legends","japan legend"],
    "responses": ["The most popular Japanese myths are about how Japanese islands were created and how the emperor of Japan was ascended to the world. These myths were originally mentioned in Kojiki and Nihon Shoki, the first history books written in Japanese around the 8th century. According to the legend, the islands of Japan were created by 2 divine gods Izanami and Izanagi who were siblings. Izanagi later gave birth to 3 gods including the Sun God Amaterasu. The grandson of Ameterasu turned into a human being and ascended to the world. That person was Gimmu, the first emperor of Japan. There are many gods in Japanese mythology but the sun god Amaterasu is the most important god and her 3 sacred belongings (the mirror, jewel and sword) are still kept by the imperial family today."],
    "context":[""]
    },
    {"tag":"creatures_monsters",
    "patterns": ["what are creatures in japan","creatures in japan","japan creature","monsters in japan","japan monster","japanese monster"],
    "responses": ["In Japanese folklore, monsters, demons and supernatural creatures are usually called youkai or akuma. Their origins go back to the creation legends of Shinto and the Buddhist beliefs. You can also think of them as evil characters in folk stories. The three most commonly known youkai characters are: 1- Tengu: It has a distinctive long nose. It is not always evil; Tengu is also known as the protective demon of Buddhist temples. 2- Yuki Onna: The snow woman with long dark hair wearing a white dress. More common in stories from Northern Japan. 3- Hitotsume Kozo: A one-eyed bald child in folk stories. And a lot of monsters in history or urban monster stories are spread from person to person, you believe or not?"],
    "context":[""]
    },
    {"tag":"beliefs_concepts",
    "patterns": ["japan beliefs","beliefs","belief","japanese belief","what about japan belief"],
    "responses": ["Mottai Nai: Nothing should be wasted, nothing should be thrown away. Wabi Sabi: Things that are old and natural are more aesthetically pleasing. Shibumi: Simple is the best. Mono-no-aware: It is the reality of life that beautiful things in our lives don't last forever.Kaizen: Continuous improvement. Things are never perfect, we should keep improving.Johakyu: Slow start and sudden finish. Many Japanese movies follow this structure.Omote nashi: Serve your guests from the heart.Zen: Simple actions in our lives lead to awakening of our spirits."],
    "context":[""]
    },
    {"tag":"proverbs",
    "patterns": ["proverbs in japan","japan proverb","proverb","japanese proverbs"],
    "responses": ["Isogeba maware: If you are trying to take a shortcut, you are likely to make a mistake. Ryouyaku wa kuchi ni nigashi: Good medicine usually tastes bitter. Fukusui bon ni kaerazu: If something is done, there is no going back. Ueni mo ue ga aru: Even the top has a top. Shitashiki naka nimo reigi ari: Even among friends, you should follow the etiquette. Nanakorobi yaoki: Even if you fall 7 times, you must stand up for your 8th challenge. Deru Kui Utareru: Those who are different get hammered down. Taisetsuno koto ha meni mienain da: Important things are not visible to the eye. Saru mo ki kara ochiru: Even monkeys fall from trees. It is natural to make mistakes. Hana yori dango: Instead of appearance you should care about substance."],
    "context":[""]
    },
    {"tag":"superstitions",
    "patterns": ["what about superstitions","japan superstitions","superstition in japan","superstiion","superstitions"],
    "responses": ["Japanese people believe that breaking a comb brings bad luck. In Japanese language the number 4 sounds the same with death so many buildings do not have the 4th floor (4th floor is simply called 5th floor).In Japan people don't whistle at night because it may bring out snakes.Seeing a spider in the morning brings good luck. Killing a spider in the morning brings bad luck.If you hear a crow's caw it brings bad luck. If you take a rest after eating you may become a pig.Cutting fingernails at night sets a curse on your family.Sleeping by facing north brings bad luck because only at the funeral house the deceased faces north."],
    "context":[""]
    },
    {"tag":"tea_ceremony",
    "patterns": ["what is tea ceremony in japan","tea ceremony","tea arts","japan tea ceremony","japan tea art","japanese tea ceremony"],
    "responses": ["Japanese tea ceremony is preparing and drinking matcha tea in a ceremonial way by using traditional utensils. The purpose of Japanese tea ceremony is to create bonding between the host and guest and also gain inner peace in our busy daily lives. Japanese people consider tea ceremony very important because it was started by the elite zen monks and practiced by noble warlords for most of history.  During the ceremony, the participants practice silence, respect, mindfulness and symbolic purification. While some Japanese perform Tea ceremony as just a hobby today, most people consider it as a form of traditional arts and call it the art of tea."],
    "context":[""]
    },
    {"tag":"sumo",
    "patterns": ["what about sumo","sumo wrestling","japan sumo","japanese sumo","sumo wrestling in japan","wrestling"],
    "responses": ["Sumo wrestling emerged as a shinto ceremony to entertain gods. People believed that if the gods were not pleased, they would not bring a good harvest season. That is why, the sumo stage, dohyo, has been considered very sacred. On the ceiling of the sumo wrestling ring, there is usually a roof of a shinto shrine. The wrestlers throw salt on to the stage for symbolic purification and do irregular warm up routines to scare evil spirits away. The rounds usually last only 20-30 seconds and If the round takes more than 4 minutes the referee asks for a break.The sumo wrestlers usually eat a high-calorie dish called chanko nabe which is beef stew and vegetables hot pot. Young sumo wrestlers consume around 20,000 calories of food a day. That is why they can get fat so easily and quickly."],
    "context":[""]
    },
    {"tag":"hobbies_games",
    "patterns": ["what are japanese hobbies","japan hobbies","japanese hobbies","hobbies and games","what about japanese hobbies"],
    "responses": ["The most popular hobby in Japan is to travel as people love traveling domestically and internationally. Other three common leisure activities are karaoke, shogi and kendama. Kara-oke means empty orchestra. Even though karaoke was born in Kobe city of Japan, there are more than 100,000 karaoke venues all around the world. Shogi means general's board game. It is similar to chess and consists of a wooden board and 40 pentagon-shaped pieces. Kendama is a popular cup-and-ball game among teenagers. The purpose is to put the ball at the end of the string into the cup without touching it. "],
    "context":[""]
    },
    {"tag":"performing_arts ",
    "patterns": ["performing art in japan","performing arts","performing art","japan performing art","japanese performing arts"],
    "responses": ["The top 3 most common Japanese performing arts are Kabuki, the Noh performance and the Bunraku puppet theater. Kabuki was born next to the Kamo River in Kyoto where female entertainers performed plays. During the Edo Period, Kabuki actors probably were the most famous people in the country whose images were widely distributed by Ukiyo-e prints. The red color on the face represents anger and the black color represents fear. Noh is a slow-paced dance-drama which is a combination of folk dance and the Shinto rituals. The topic is usually how a supernatural being turns into a human. Bunraku is the traditional puppet theater where puppeteers cover all of their body with black fabric to make themselves invisible."],
    "context":[""]
    },
    {"tag":"music_instruments",
    "patterns": ["what about music instruments","music instruments","japan music instrument","japanese music instruments","what are music instruments of japan"],
    "responses": ["During the Heian period, the music entertainment was very important for the court nobilities. The three musical instruments that existed back then were the lute (also known as biwa in Japanese), the Asian stringed instrument named koto and the big Japanese drum called taiko. Taiko was also used in battles by the samurai to communicate with clan leaders and intimidate the enemy. During the peace period shamisen became popular. Shamisen is the Japanese guitar played in kabuki and bunraku performances. Traditionally the strings of shamisen were made out of silk and the body is covered by snake skin or cat skin. The most well-known Japanese folk song is called sakura-sakura which talks about how beautiful the feeling of the cherry blossom in Japan is."],
    "context":[""]
    },
    {"tag":"cloth_wrapping",
    "patterns": ["cloth wrapping","japan cloth wrapping","japanese cloth wrapping","what about japan cloth wrapping"],
    "responses": ["Japanese cloth wrapping is called furoshiki, and is the act of wrapping important items in Japanese cloth. This traditional craft emerged as a way to preserve old fabrics and utilize them in a practical way. Furoshiki is a good example of Japan's mottai-i nai concept which means nothing should be wasted. Some furoshiki wraps look like baskets, bags or even more complex designs! Furoshiki has become very popular in Japan and overseas as wrapping items such as gifts has been seen as trendy and eco-friendly."],
    "context":[""]
    },
    {"tag":"calligraphy_shodo",
    "patterns": ["what is shodo","shodo in japan","japan calligraphy","japanese calligraphy","calligraphy in japan","what about japanese calligraphy"],
    "responses": ["There are 3 different alphabets in Japanese which are hiragana (46 characters), Katakana (46 characters) and Kanji (approx. 20,000 characters). Japanese calligraphy, shodo, is the art of writing these Japanese characters in an aesthetically pleasing way. The samurai often practiced calligraphy especially during the Edo period. The four stages of Japanese calligraphy are: 1- Perfect Concentration 2- Continuity 3- Appreciation of Beauty 4- Formation of human character.One of the most surprising things about Japanese calligraphy is the brush. The best brushes are usually made out of horsehair. The weasel-hair brush would be ideal to make thinner lines but it tends to be expensive."],
    "context":[""]
    },
    {"tag":"origami",
    "patterns": ["what is origami","japan origami","paper wrapping","japanese origami","japan wrapping paper","wrap paper"],
    "responses": ["Origami is possibly the most well-known of all of Japan's cultural activities. This is practiced as an art where paper is folded to create a range of shapes including animals, flowers or people. Japanese children learn origami at elementary school to improve their focusing skills and understand the importance of following the instructions to reach an ultimate goal.This is one of the best family activities for travelers visiting Japan where the members can learn from and compete against each other and keep the paper figure they make."],
    "context":[""]
    },
    {"tag":"kintsugi",
    "patterns": ["what is kinstugi","japan kintsugi","golden joinery"],
    "responses": ["The Japanese have an art form called Kintsugi, which translates as golden joinery. It is a rather unusual practice involving mending broken pottery with lacquer mixed with powdered precious metals. The philosophy behind Kintsugi is similar to wabi-sabi, which teaches appreciation of the imperfect things in the world. Instead of discarding damaged objects, Japanese people often repair them and use them for centuries. This art also represents appreciating our scars and failures."],
    "context":[""]
    },
    {"tag":"bonsai",
    "patterns": ["what is bonsai","japan gardening style","tree cutting","japan bonsai","japan tree cutting","bonsai","what about bonsai"],
    "responses": ["Bonsai, also known as bongsai, means plant in a tray. Bonsai refers to small trees that grow in tiny trays but still look natural in terms of appearance and details. Just like a normal tree, the bonsai trees change during all four seasons. Contrary to the common view, bonsai trees are not dwarf trees and there is no special seed for them. Many different kinds of plants can be turned into bonsai by using wires to shape the branches and specific scissors to trim the edges. The art of bonsai was influenced by Zen. The bonsai master must patiently wait for years to grow the tree and still keep balance, harmony and the natural look on the tree."],
    "context":[""]
    },
    {"tag":"geisha",
    "patterns": ["what is geisha","geisha","japan geisha","japanese geisha","geisha in japan"],
    "responses": ["Gei-sha means the person of art. The first geisha to appear were men who entertained groups of people enjoying parties. The apprentice geisha is called maiko when she has to live in the geisha lodging house for 5 years without using a cell phone and seeing her family only once a month. Professional geishas know all major Japanese cultural traditions and arts including tea ceremony, ikebana flower arrangement, Japanese buyou dance, shamisen playing, Japanese calligraphy and etc.. The most popular geisha neighborhoods are located in Kyoto where watching a private geisha dance performance may cost up to $5000 a night. Geishas' silk kimonos and jewelry are also very expensive, costing more than a typical employee's annual salary."],
    "context":[""]
    },
    {"tag":"ikebana",
    "patterns": ["what is ikebana","japan flower arranging","arrange flowers","japan arrange flower","arrange flowers in japan","ikebana"],
    "responses": ["Ikebana means making flowers alive or giving flowers life. It is the Japanese way of flower arrangement also known as kado. During the Heian period, the priests who took care of altar arrangements were called ikebono and they are the first known masters who developed the best way of arranging flowers. Ikebana has simple rules influenced by simplicity and minimalism in Buddhism. There are usually 3 types of main flowers: primary flower in the middle, the secondary flower right next to it and an ornamental flower down below. There are also 2 main types of vases: the wide and low vase called moribana and the tall thin vase called nageire."],
    "context":[""]
    },
    {"tag":"ukiyoe",
    "patterns": ["what is ukiyoe","ukiyoe","japan handmade woodblock"],
    "responses": ["Ukiyoe refers to handmade woodblock prints that emerged in the 17th century. Ukiyo means the floating world and e means picture. One of the interesting things about ukiyoe is you need many woodblock molds for each color to produce a ukiyoe print. Ukiyoe paintings are known for their bold lines and the lack of perspective. Most well-known ukiyoe prints are those that depict famous kabuki artists as it was forbidden to draw the samurai or anyone from the family of the shogun during the Edo Period. It was also forbidden to criticize the samurai class in the ukiyoe paintings. The most famous ukiyoe painting drawn by Hokusai in 1877 is called the great wave of Kanagawa."],
    "context":[""]
    },
    {"tag":"popular_culture",
    "patterns": ["what is popular culture in japan","modern culture","popular culture","popular culture in japan","what about popular culture"],
    "responses": ["Most people associate modern Japanese culture with manga, anime. Manga and anime are not the same things. Manga is the Japanese word for printed comics although nowadays most people read them online. Anime is Japanese abbreviation for animated comics. Japanese anime market is estimated to be worth $20 billion, higher than the $4 billion manga market. The anime titled Sazae-san is the world's longest lasting cartoon with more than 7400 episodes. Contrary to the common belief, the eyes of the manga characters are big not because Japanese want to have big eyes but because big eyes appear more appealing in general. Did you know that in Japan there is more paper used for manga books compared to toilet paper?"],
    "context":[""]
    },
    {"tag":"japan_chess",
    "patterns": ["what is japanese chess","japan chess","chess in japan","chess of japan","japanese chess","what about japan chess","shogi","what is shogi"],
    "responses": ["Shogi  also known as Japanese chess, is a strategy board game for two players. It is one of the most popular board games in Japan and is in the same family of games as Western chess, chaturanga, Xiangqi, Indian chess, and janggi. Shogi means general's (sho) board game (gi). Shogi was the earliest historical chess-related game to allow captured pieces to be returned to the board by the capturing player.This drop rule is speculated to have been invented in the 15th century and possibly connected to the practice of 15th century mercenaries switching loyalties when captured instead of being killed."],
    "context":[""]
    },
    {"tag":"security",
    "patterns": ["what about security","security in japan","japan security","japanese security"],
    "responses": ["Japan's capital market has become one of the pillars of the global 24-hour securities market. The secondary bond market has been in operation since the mid-1960s, and, although over-the-counter transactions have risen rapidly, a significant proportion of the business consists of trading in financial debentures. In the 1980s efforts were made to expand the bond market by introducing a greater diversity of bond instruments and by establishing a number of bond-rating institutions."],
    "context":[""]
    },
    {"tag":"election",
    "patterns": ["what about election","election in japan","japan election","japanese election","can you tell me about election"],
    "responses": ["Similar seat reductions were carried out in the House of Councillors, with the number brought down from 252 to 247 in 2000 (effective in 2001) and then to 242 in 2004. Members of the House of Representatives are elected to four-year terms, which may be terminated early if the house is dissolved. Members of the House of Councillors are elected to six-year terms, with half the members being elected every three years."],
    "context":[""]
    },
    {"tag":"marriage",
    "patterns": ["marriage in japan","japan marriage","japanese marriage","tell me about marriage","marriage","what about marriage"],
    "responses": ["Marriage in Japan is a legal and social institution at the center of the household. Couples are legally married once they have made the change in status on their family registration sheets, without the need for a ceremony. Most weddings are held either according to Shinto traditions or in chapels according to Christian marriage traditions.Traditionally, marriages in Japan were categorized into two types according to the method of finding a partner—omiai, meaning arranged or resulting from an arranged introduction, and ren'ai, in which the husband and wife met and decided to marry on their own—although the distinction has grown less meaningful over postwar decades as Western ideas of love have altered Japanese perceptions of marriage."],
    "context":[""]
    },
    {"tag":"novel_recommend",
    "patterns": ["japan novel","japanese novel","cam you recommend novels","recommend novel","suggest japanese novel","novel","novel in japan","novels"],
    "responses": ["If you read a lot, it is recommended to read Japanese novels. Here's a list for you: Norwegian Wood (Haruki Murakami), Kokoro (Soseki Natsume), No Longer Human (Osamu Dazai), Rashomon (Ryunosuke Akutagawa), Kafka on the Shore (Haruki Murakami)."],
    "context":[""]
    },
    {"tag":"book_recommend",
    "patterns": ["japan book","japanese book","cam you recommend books","recommend book","suggest japanese book","book","book in japan","books"],
    "responses": ["There are some books I can recommend you: Coin Locker Babies by Ryuo Murakami, Convenience Store Woman by Sayaka Murata, The Sailor Who Fell from Grace with the Sea by Yukio Mishima, Strange Weather in Tokyo by Hiromi Kawakami, I Am a Cat by Natsume Soseki, Some Prefer Nettles by Junichiro Tanizaki,The Pillow Book by Sei Shonagon, Schoolgirl by Osamu Dazai, Hard-Boiled Wonderland and the End of the World by Haruki Murakami, Vibrator by Mari Akasaka. If you want some self confidence books or academic books, these are not books for you. Please tell me by another key word. "],
    "context":[""]
    }

]
}
